import type { ReactElement } from "react"
import Image from "next/image"
import { Layout } from "@components/common"
import { Breadcrumbs, Card, Section } from "@components/ui"
import Head from "@modules/common/components/head"

import a15 from "../../public/img/A15.jpg"
import ba400 from "../../public/img/BA400.jpg"
import dynexDs2 from "../../public/img/DynexDS2.jpg"
import elite3 from "../../public/img/ELite3.jpg"
import humaclot from "../../public/img/humaclot.jpg"
import immulite2000xpi from "../../public/img/immulite-2000xpi.png"
import microscope from "../../public/img/microscope.jpg"
import sysmexXN550 from "../../public/img/sysmex_XN_550.jpg"
import terraLab from "../../public/img/terralab.png"
import makagon from "../../public/makagon_i.jpg"

const About = () => {
  return (
    <>
      <Head
        title="Про лабораторію - українська медична лабораторія VitaLab"
        description="Медичні лабораторні дослідження у Дніпрі. Понад 400 аналізів. Європейське обладнання та стандарти якості."
      />
      <Section>
        <div className="pb-20 md:pb-32">
          <div
            className="section__row-layout"
            style={
              {
                "--row-layout-gap": `var(--row-layout-gap-large)`,
              } as React.CSSProperties
            }
          >
            <Breadcrumbs title="Про лабораторію" />
            <div className="grid gap-y-6">
              <header className="relative grid max-w-[810px] gap-y-6 px-4 md:hidden">
                <h1 className="text-xl font-medium leading-tight text-gray-900 md:text-4xl">
                  Про лабораторію
                </h1>
              </header>
              <div className="px-4 font-normal text-gray-900 md:mr-6">
                <p className="mb-4">
                  Vitalab – це сучасна українська лабораторія, яка надає медичні
                  послуги, що відповідають вимогам чинного законодавства та
                  європейським стандартам.
                </p>
                <p className="mb-4">
                  Наша місія - сформувати сучасну культуру лабораторної
                  діагностики в Україні, керуючись інтересами пацієнтів.
                </p>
                <p className="mb-4">
                  Важливість якісної лабораторної діагностики складно
                  переоцінити, тому з метою гарантування якості та
                  компетентності медичних лабораторій у всьому світі
                  запроваджено систему стандартів якості. Лабораторія Vitalab
                  навесні 2024 року підтвердила свою компетентність та якість
                  послуг, отримавши однією з перших в Україні акредитацію за
                  найновішим міжнародним стандартом ISO 15189:2022 «Медичні
                  лабораторії – Вимоги до якості та компетентності».
                </p>
                <p className="mb-4">
                  Лабораторія Vitalab розташована у центральній частині міста
                  Дніпро і має розвинену мережу пунктів забору біоматеріалу у
                  місті та області. Передове обладнання і технології дозволяють
                  надавати результати певних лабораторних досліджень пацієнтам
                  всього за 1-6 годин після того, як біоматеріал надходить до
                  лабораторії. Більшість загальноклінічних, біохімічних та
                  імунологічних аналізів виконуються день у день.
                </p>
                <p className="mb-4">
                  Якість і точність досліджень забезпечується використанням
                  сучасних сертифікованих аналізаторів, обладнання та реактивів,
                  постійною участю лабораторії Vitalab у авторитетних
                  міжнародних програмах контролю якості (RIQAS, Prevecal,
                  Labquality).
                </p>
                <p className="mb-4">
                  Команда Vitalab – це колектив професіоналів своєї справи, які
                  постійно підвищують свою кваліфікацію. Ми забезпечуємо
                  пацієнтів та лікарів активною консультативною підтримкою,
                  завжди готові надати детальні пояснення щодо результатів
                  лабораторних досліджень. Також наші спеціалісти підтримують
                  зворотний зв’язок з лікуючими лікарями при виявленні критичних
                  значень в результатах лабораторних досліджень.
                </p>
                <p className="mb-4">
                  Наші пацієнти можуть бути впевнені у безпеці своїх особистих
                  даних, адже ця інформація шифрується та зберігається на
                  захищених від кібератак сховищах. Дотримання конфіденційності
                  та збереження медичної таємниці – один з найбільших
                  пріоритетів Vitalab.
                </p>
                <p className="mb-4">
                  Сучасний портал обслуговування пацієнтів Vitalab дозволяє
                  користуватися сервісами лабораторії онлайн. Всі зареєстровані
                  користувачі порталу мають особистий кабінет, через який можна
                  замовляти аналізи для себе та своїх близьких, сплачувати
                  замовлення онлайн та переглядати результати досліджень 24/7.
                  Результати також можна отримувати у месенджерах та електронною
                  поштою.
                </p>
                <p className="mb-4">
                  Лабораторія Vitalab є офіційним партнером-представником одного
                  з найбільших європейських лабораторних концернів - Limbach
                  Gruppe. Тому наші пацієнти мають можливість навіть під час
                  війни отримати результати найскладніших і рідкісних досліджень
                  від європейських лабораторій, не виїжджаючи з України.
                </p>
                <p className="mb-4">
                  Команда Vitalab глибоко шанує та дякує українським військовим,
                  які ризикують своїм життям, захищаючи нас та нашу країну. Саме
                  тому ми пропонуємо спеціальні умови для чинних
                  військовослужбовців ЗСУ. Окрім того, у Vitalab діють постійні
                  знижки для вимушених переселенців, пенсіонерів та людей з
                  обмеженими можливостями.
                </p>
                <p className="mb-4">
                  Для того, щоб лабораторні послуги залишалися доступними,
                  Vitalab пропонує регулярні акції, знижки на аналізи при
                  оформленні замовлень онлайн, розробляє актуальні пакети
                  досліджень за спеціальною ціною. Для зручності пацієнтів діють
                  виїзні бригади для забору біоматеріалу вдома чи на роботі.
                </p>
                <p className="mb-4">
                  Піклуйтеся про своє здоров’я разом із лабораторією Vitalab!
                </p>
              </div>
            </div>
          </div>
        </div>
      </Section>
    </>
  )
}

About.getLayout = (page: ReactElement) => {
  return <Layout>{page}</Layout>
}

export default About
