import { ReactElement } from "react"
import { Layout } from "@components/common"
import { Breadcrumbs, Card, Heading, Section } from "@components/ui"
import {
  Accordion,
  AccordionContent,
  AccordionItem,
  AccordionTrigger,
} from "@components/ui/accordion"
import { AdBlock } from "@components/ui/ad-block"
import { ChevronDownIcon } from "@heroicons/react/24/solid"
import Head from "@modules/common/components/head"
import * as AccordionPrimitive from "@radix-ui/react-accordion"
import clsx from "clsx"
import { Eye } from "lucide-react"

import car from "../../public/img/vitalab_car.jpg"

interface AccordionItem {
  header: string
  content: any
}

const items: AccordionItem[] = [
  {
    header: "Підготовка до здачі аналізів крові",
    content: [
      {
        heading: "Загальні правила",
        list: [
          <ul>
            <li>
              - Важливою умовою для лабораторних досліджень є забір крові
              натщесерце (6-12 годин після останнього прийому їжі).
            </li>
            <li>
              - Останній прийом їжі для дітей до 1 року - за 3-5 годин, для
              інших вікових категорій – за 8-12 годин (12 годин для досліджень
              ліпідного спектру) до забору крові. Для грудних дітей перед
              забором крові витримати максимально можливу паузу між годуваннями,
              напувати по можливості теплою водою.
            </li>
            <li>
              - В день дослідження допустиме вживання невеликої кількості
              очищеної негазованої води води (окрім таких аналізів як час
              згортання, тривалість кровотечі). Це сприяє зниженню в'язкості
              крові, отже, спрощує процес збору необхідного обсягу крові і
              знижує ймовірність утворення згустків у пробірці.
            </li>
            <li>
              - За 10 - 12 годин до забору крові слід виключити вживання
              алкоголю, обмежити фізичну активність, обмежити прийом жирних та
              смажених страв.
            </li>
            <li>
              - Не палити (у тому числі вейпи) протягом принаймні однієї години
              до забору крові.
            </li>
            <li>
              - Виключити прийом ліків вранці; якщо відмінити прийом ліків
              неможливо, необхідно проінформувати про це лабораторію та лікаря.{" "}
            </li>
            <li>
              - Рекомендується здавати кров через 10-14 днів після закінчення
              курсу прийому лікарських препаратів, біологічно активних добавок
              (БАДів), спортивного харчування.F3
            </li>
          </ul>,
        ],
      },
      {
        heading: "Підготовка при дослідженнях на гормони",
        list: [
          <>
            <ul>
              <li>
                - Кров для визначення вмісту гормонів потрібно здавати вранці,
                натщесерце (до 10 години ранку). День, коли потрібно здавати
                кров жінкам репродуктивного віку, визначає лікар, в залежності
                від мети дослідження.
              </li>
              <br />
              <strong>Статеві гормони у жінок:</strong>
              <li>
                - Дослідження{" "}
                <strong>ФСГ, ЛГ, естрадіолу, пролактину, тестостерону</strong>{" "}
                проводяться на 3-7 день менструального циклу, якщо інше не
                вказано лікарем.
              </li>
              <li>
                - <strong>Пролактин</strong> - повинно пройти не менше 2-3 годин
                із моменту пробудження, але не більше 4 годин після пробудження.
                За 24 годин до дослідження слід виключити стресові ситуації,
                прийом алкоголю, обмежити фізичну активність, гарячі ванни,
                сауни, лазню, статеві контакти, пальпацію молочних залоз,
                подразнення сосків та теплові процедури, огляд гінеколога,
                гінекологічні процедури, узд молочних залоз.
              </li>
              <li>
                - <strong>Прогестерон</strong> – на 21 день менструального
                циклу, якщо інше не вказано лікарем.{" "}
              </li>
              <li>
                - <strong>Антимюллерів гормон</strong> - на 3-5 день циклу, якщо
                інше не вказано лікарем.
              </li>
              <li>
                - <strong>Інгібін В</strong> – на 3-4 день циклу, якщо інше не
                вказано лікарем.
              </li>
            </ul>
            <br />
            <ul>
              <strong>Гормони щитовидної залози</strong>
              <li>
                - Дослідження необхідно проводити через 24 години після прийому
                препаратів, що містять гормони щитовидної залози.{" "}
              </li>
              <li>
                - За 2-3 дні до аналізу виключити прийом йодовмісних продуктів
                та ліків (морепродукти, волоські горіхи, йодована сіль і т. д.).
              </li>
            </ul>
          </>,
        ],
      },
      {
        heading: "Коагулограма (ПЧ, АЧТЧ, МНВ, фібриноген)",
        list: [
          "За 2-3 дні до дослідження необхідно виключити прийом антикоагулянтів (гепарин, варфарин і т.д.) та антиагрегантів (аспірин, тромбоас), якщо інше не вказано лікарем.",
        ],
      },
      {
        heading: "Глюкоза",
        list: [
          "Кров забирається суворо натщесерце. Не рекомендується навіть чистити зуби, жувати жувальні гумки. Необхідно дотримуватись протягом 3 діб дієти з низьким вмістом вуглеводів.",
        ],
      },
      {
        heading:
          "Глюкозотолерантний тест (вагітні - за попереднім записом, за адресою вул. Херсонська 10-А)",
        list: [
          <ul>
            <li>
              - Натщесерце, в ранкові години, після восьмигодинного утримання
              від їжі та за умови відсутності гострих захворювань, гострих травм
              і оперативних втручань.
            </li>
            <li>
              - Здається тільки за направленням лікаря із зазначенням дозування
              глюкози!
            </li>
            <li>
              - Визначається (для вагітних – лише на аналізаторі, не
              глюкометром!) рівень венозної глюкози натщесерце.
            </li>
            <li>
              - При рівні глюкози менше 5.1 ммоль/л дослідження продовжується.
            </li>
            <li>
              - Пацієнт вииває протягом 3-5 хвилин глюкозу у призначеній лікарем
              дозі, розчинену у 300 мл води.
            </li>
            <li>
              - Повторне взяття крові здійснюється через 2 години. (1 проба
              після навантаження)
            </li>
            <li>
              - Повторне взяття крові здійснюється через 1 годину, і ще через 1
              годину. (2 проби після навантаження).
            </li>
            <li>
              - Протягом цього часу пацієнт повинен перебувати в стані спокою,
              йому можна пити негазовону воду і не можна їсти.
            </li>
            <li>
              - Оплата здійснюється за повний глюкозотолерантний тест, якщо
              глюкоза в нормі після першого венозного забору натщесерце. Якщо
              рівень глюкози натщесерце вищий за норму пацієнт з результатом
              направляється за подальшими інструкціями до лікуючого лікаря або
              лікаря, який веде вагітність.
            </li>
          </ul>,
        ],
      },
      {
        heading: "Простат-специфічний антиген загальний (ПСА)",
        list: [
          <ul>
            <li>- Протягом 48 годин слід утримуватися від еякуляції.</li>
            <li>
              - Рекомендується забирати кров на це дослівдження не раніше, ніж
              через 3 дні (оптимально через 6–7 днів) після проведення будь-яких
              урологічних маніпуляцій, пальцевого ректального обстеження,
              ергометрії, цистоскопії та колоноскопії, масажу простати.
            </li>
            <li>
              - Після проведення біопсії простати оптимально проводити
              тестування не раніше, ніж через три тижні.
            </li>
            <li>
              - Рекомендується утриматися від фізичних вправ, які можуть
              вплинути на передміхурову залозу (велосипедний спорт), теплових
              впливів (сауна) протягом трьох днів до забору біоматеріалу.
            </li>
          </ul>,
        ],
      },
      {
        heading: "Альдостерон-ренінове співвідношення",
        list: [
          <ul>
            <li>
              - За 6-12 годин до дослідження слід виключити стресові ситуації,
              прийом алкоголю, паління, обмежити фізичну активність.
            </li>
            <li>
              - Погодити з лікарем скасування прийому препаратів, що можуть
              вплинути на результат. Якщо відмінити прийом ліків неможливо,
              необхідно проінформувати адміністратора на пункті забору
              біоматеріалу про це перед забором крові.
            </li>
            <li>
              - Перед забором крові пацієнт повинен знаходитись у вертикальному
              положенні (стоячи або сидячи) не менше, ніж 2 години, а потім 5
              хвилин сидячи у повному спокої.
            </li>
            <li>
              - За вказівкою лікаря можливий відбір крові після перебування
              протягом 1-2 годин в горизонтальному положенні.
            </li>
            <li>
              - Прийом препаратів, які можуть вплинути на результати дослідження
              - діуретики, гіпотензивні препарати, оральні контрацептиви,
              препарати солодки, глюкокортикоїди, а також фізичні навантаження,
              безсольова дієта, алкоголь, паління, час доби, часовий відрізок
              постурального положення.
            </li>
          </ul>,
        ],
      },
      {
        heading: "Пренатальний скринінг (1-2 триместру)",
        list: [
          "Для виконання пренатального скринінг першого триместру (у строк вагітності від 11 до 13 тижнів та 6 днів), та другого триместру (у строк вагітності від 19 до 20 тижнів та 6 днів) необхідний заповнений лікарем «Бланк з пренатального скринінгу» разом з результатами УЗД плоду. Копія результатів УЗД передається до лабораторії. ",
        ],
      },
    ],
  },
  {
    header: "Підготовка до здачі аналізів сечі",
    content: [
      {
        heading: "Загальні правила",
        list: [
          <>
            <ul>
              <li>
                - Збір сечі бажано проводити вранці ( середня, спонтанна
                порція).
              </li>
              <li>
                - Перед збором сечі обов'язково проводити туалет зовнішніх
                статевих органів.
              </li>
              <li>
                - Напередодні збору сечі не рекомендується вживати овочі та
                фрукти, які можуть змінити її колір (буряк, морква, журавлина та
                ін.).
              </li>
              <li>
                - Виключається прийом сечогінних препаратів за 48 годин до збору
                сечі. Проба проводиться при звичайному питному режимі і
                харчуванні.
              </li>
              <li>
                - Жінкам не рекомендується здавати аналіз сечі під час
                менструації. Для уникнення потрапляння в сечу виділень із піхви,
                жінкам рекомендується ввести у піхву тампон.
              </li>
              <li>- Сеча, вичавлена з памперсу, дослідженню не підлягає.</li>
            </ul>
            <br />
            <strong>
              Увага! Біоматеріал для дослідження приймається лише у пластикових
              контейнерах із закручуваною кришкою.
            </strong>
          </>,
        ],
      },
      {
        heading: `Загальний аналіз сечі / ph`,
        list: [
          <>
            <strong>Вся порція ранкової сечі</strong> збирається в суху, чисту,
            пластикову ємність.
            <ul>
              <li>
                - Після цього сечу в кількості не менше 10 мл потрібно відлити в
                чисту, суху ємність (стерильний контейнер для сечі), в якій вона
                буде доставлена в лабораторію. Під час збору сечі намагайтеся не
                торкатися контейнером до тіла.
              </li>
              <li>
                - Для грудних дітей – після ретельного туалету статевих органів
                бажано збирати сечу в сечоприймач.
              </li>
            </ul>
          </>,
        ],
      },
      {
        heading: `Сеча по Нечипоренко`,
        list: [
          <ul>
            <li>
              - Для правильного проведення дослідження при першому ранковому
              сечовипусканні невелику кількість сечі слід спустити в туалет,
              потім середню порцію зібрати у пластиковий стерильний контейнер,
              решту - в туалет
            </li>
            <li>
              - Для грудних дітей – після ретельного туалету статевих органів
              бажано збирати сечу в сечоприймач. Сеча, вичавлена з памперсу,
              дослідженню не підлягає. Сечу збирають в спеціальний контейнер.
            </li>
          </ul>,
        ],
      },
      {
        heading: `Діастаза сечі (альфа-амілаза)`,
        list: [
          <p>
            Рівень діастази в сечі змінюється протягом доби, тому матеріал на
            аналіз необхідно збирати в ранковий час, а після збору - бажано
            якнайшвидше доставити у лабораторію. У деяких випадках за вказівкою
            лікаря можливий збір сечі протягом двох годин або збір добової сечі.
          </p>,
        ],
      },
      {
        heading: `3-х склянкова проба сечі (мікроскопічне дослідження)`,
        list: [
          <p>
            Збирається ранкова сеча в 3 стерильні контейнери: у 1-му початкова
            порція, у 2-му середня, в 3-му кінцева порція
          </p>,
        ],
      },
      {
        heading: `Аналіз сечі за Зимницьким`,
        list: [
          <ul>
            <li>
              - За 12 годин до збору сечі виключити із раціону гостру і солону
              їжу.{" "}
            </li>
            <li>
              - Для проведення проби за Зимницьким за добу збирають 8 порцій
              сечі. О 6:00 ранку сечовий міхур спорожнюють (ця порція
              виливається). Потім, починаючи з 6:00 ранку, точно кожні 3 години
              збирають 8 порцій в окремі ємності (до 6:00 ранку наступного дня).{" "}
            </li>
            <li>
              - Увага! Одна порція – повністю вся випущена сеча за один раз! На
              кожній банці відзначається час збору сечі. Якщо сечовипускання
              відсутнє у будь-якому із проміжків часу, то ця ємність залишається
              порожньою і не доставляється в лабораторію. Всі контейнери з сечею
              необхідно зберігати в прохолодному місці, не допускаючи
              заморожування та перегрівання. І порція - з 6:00 до 9:00; II
              порція - з 9:00 до 12:00; ІІІ порція - з 12:00 до 15:00; IV порція
              - з 15:00 до 18:00; V порція - з 18:00 до 21:00; VI порція - з
              21:00 до 24:00; VII порція - з 24:00 до 3:00; VIII порція - з 3:00
              до 6:00.
            </li>
          </ul>,
        ],
      },
      {
        heading: `Біохімічні дослідження (разова порція сечі)`,
        list: [
          <p>
            Для даних досліджень рекомендовано виконати збір середньої порції
            сечі при ранковому сечовипусканні в стерильний контейнер 30-50
            мл.2:50
          </p>,
        ],
      },
      {
        heading: `Біохімічні дослідження (добова сеча)`,
        list: [
          <ul>
            <li>
              - Для збору добової сечі необхідно використовувати суху, чисту
              ємність, бажано з темного скла або після збору матеріалу помістити
              контейнер у темний пакет. При цьому ємність з сечею необхідно
              зберігати в прохолодному місці, оптимально в холодильнику на
              нижній полиці при t= + 2 - +8 С, не допускаючи її заморожування.
            </li>
            <li>
              - Після збору добової сечі, попередньо максимально точно виміряти
              добовий об’єм сечі, ретельно перемішати і відлити 30-50 мл від
              загального об’єму в чисту, суху ємність (стерильний одноразовий
              контейнер для сечі). Ємність із сечею щільно закривається кришкою,
              поміщається в чистий одноразовий пакет і доставляється зранку в
              лабораторію.
            </li>
            <li>
              - Обов’язково написати на контейнері об’єм сечі, зібраної за добу
              (добовий діурез).
            </li>
          </ul>,
        ],
      },
      {
        heading: `Проба Реберга та транспорт солей (добова сеча + кров)`,
        list: [
          <ul>
            <li>
              - Збір добової порції сечі (перемішати та відлити 30-50 мл добової
              сечі в стерильний контейнер). Вказати добовий діурез. Принести
              сечу до лабораторії вранці.
            </li>
            <li>
              - Кров: натщесерце провести забір венозної крові. З урахуванням
              добових ритмів зміни показників крові, зразки доцільно брати в
              один і той же час.
            </li>
          </ul>,
        ],
      },
    ],
  },
  {
    header: "Підготовка до здачі аналізів калу",
    content: [
      {
        heading: "Загальні правила",
        list: [
          <>
            <ul>
              <li>
                - Рекомендоване скасування прийому лікарських препаратів (всі
                проносні, ваго- та симпатикотропні засоби, каолін, препарати
                вісмуту, заліза, ректальні супозиторії на жировій основі,
                ферменти та інші препарати, що впливають на процеси травлення та
                всмоктування).
              </li>
              <li>
                - Не можна проводити копрологічні дослідження після клізми.
                Після рентгенологічного дослідження шлунку та кишківника
                проведення аналізу калу показане не раніше, ніж через дві доби.
              </li>
              <li>
                - Не можна проводити копрологічні дослідження за кровотечі з
                гемороїдальних вузлів, гематурії або після надмірних натужень
                під час дефекації.
              </li>
              <li>
                - При контролі лікування (перед початком лікування та після
                закінчення курсу лікування): - з прийомом антибактеріальних,
                імунобіологічних, протигрибкових препаратів – не раніше, ніж
                через 14 днів.
              </li>
              <li>
                - Варто уникати домішків до калу сечі та речовин, що виділяються
                статевими органами.{" "}
              </li>
            </ul>
            <strong>
              Увага! Біоматеріал для дослідження приймається лише у пластикових
              контейнерах із закручуваною кришкою.
            </strong>
          </>,
        ],
      },
      {
        heading:
          "Копрограма (аналіз калу загальний), фекальний кальпротектин (кількісний), панкреатична елестаза, хелікобактер (Helicobacter pilory) антиген в калі, дослідження  калу на яйця глистів, лямблія (Giardia lamblia) антиген в калі, прихована кров у калі",
        list: [
          <>
            <ul>
              <li>
                - Для копрологічного дослідження збирають свіжовиділений кал в
                суху, чисту пластикову ємність (стерильний одноразовий контейнер
                для калу) в кількості 10-15 г.{" "}
              </li>
              <li>
                - Ємність з калом щільно закривається кришкою, поміщається в
                чистий одноразовий пакет і доставляється у лабораторію протягом
                2-6 годин.{" "}
              </li>
            </ul>
            <br />
            <strong>Увага!</strong> Не рекомендовано збирати кал із унітазу.
            Збирають кал на чисту поверхню, в якості якої може бути застосований
            чистий новий паперовий аркуш, пакет із поліетилену (бажано). Кал
            беруть переважно із середньої порції спеціальною ложечкою,
            вмонтованою в кришку стерильного контейнера, із декількох місць, у
            кількості не більше 1/3 від об’єму контейнера. Не наповнюйте
            контейнер до країв. Ретельно закрийте кришку.
            <br />
            <strong>Увага!</strong> На кожне дослідження не менше 5 г калу,
            біоматеріал для всіх цих досліджень можливо збирати в один
            контейнер.
          </>,
        ],
      },
      {
        heading: "Зішкріб на ентеробіоз",
        list: [
          <ul>
            <li>- Перед забором не проводити туалет аногенітальної області.</li>
            <li>
              - Ватну паличку змочити в теплій воді, кілька разів провести
              навколо анального отвору, помістити зішкріб в стерильну ємність.
            </li>
            <li>- Доставити в лабораторію протягом 2-6 годин.</li>
          </ul>,
        ],
      },
    ],
  },
  {
    header: "Підготовка до здачі аналізів методами ІХЛ та ПЛР",
    content: [
      {
        heading:
          "Коронавірус (SARS-CoV-2, антиген, назо-орофарингеальний зішкріб), Імунохроматографічний тест для виявлення антигенів грипу А та B",
        list: [
          <ul>
            <li>
              - За 2 години до взяття мазків з ротоглотки (зіву) не вживати їжу,
              не пити рідину, не чистити зуби, не полоскати горло, не жувати
              жувальну гумка та не палити.
            </li>
            <li>
              - За 2 години до взяття мазків із носу не застосовувати краплі або
              спреї для носу, не промивати ніс. Перед взяттям мазка, при
              наявності рясних виділень з носу, необхідно очистити носові ходи -
              сильним видихом видалити слиз із носу.
            </li>
          </ul>,
        ],
      },
      {
        heading:
          "Коронавірус (РНК SARS-CoV-2, назо-орофарингеальний зішкріб), методом ПЛР",
        list: [
          <ul>
            <li>
              - Протягом 4-5 годин до моменту забору матеріалу не
              використовувати краплі для носа, не промивати і не полоскати
              носові ходи.
            </li>
            <li>
              - Взяття матеріалу проводити натщесерце/3-4 години після вживання
              їжі та напоїв
            </li>
            <li>
              - Протягом 3-4 годин до забору матеріалу не рекомендовано чистити
              зуби, полоскати рот/горло та курити
            </li>
          </ul>,
        ],
      },
      {
        heading: "Букальний зішкріб",
        list: [
          <ul>
            <li>
              - Забір матеріалу проводиться натщесерце/через 2-4 години після
              їжі.{" "}
            </li>
            <li>
              - Перед взяттям матеріалу необхідно прополоскати рот водою.{" "}
            </li>
            <li>
              - Після полоскання рекомендується помасажувати щоку, для виділення
              секрету з залоз.
            </li>
          </ul>,
        ],
      },
      {
        heading: "Ротоглотковий зішкріб",
        list: [
          <ul>
            <li>
              - Забір матеріалу проводиться натщесерце/через 2-4 години після
              їжі.
            </li>
            <li>- Перед забором матеріалу необхідно прополоскати рот водою.</li>
          </ul>,
        ],
      },
      {
        heading: "Слина",
        list: [
          <>
            <strong>Правила підготовки</strong>
            <ul>
              <li>
                - За 4 години до збору слини виключити прийом їжі, алкоголю,
                чистку зубів, лікарські препарати.
              </li>
              <li>
                - Перед збором матеріалу необхідно прополоскати рот кип'яченою
                водою.
              </li>
            </ul>
            <strong>Правила збору</strong>
            <ul>
              <li>- Сплюнути слину в сухий контейнер, не менше 1 мл. </li>
              <li>- Закрити кришку контейнеру та промаркувати ємність.</li>
            </ul>
          </>,
        ],
      },
      {
        heading: "Ліквор (приносний матеріал)",
        list: [
          <ul>
            <li>
              - Спинномозкову рідину збирають за допомогою одноразової голки, в
              одноразову суху пробірку в кількості не менше 1,0 мл.{" "}
            </li>
            <li>
              - Пробірку щільно закрити кришкою і доставити в лабораторію.
            </li>
            Увага! Пункцію виконує лише лікар і лише в умовах медичного закладу!
          </ul>,
        ],
      },
      {
        heading: "Сеча",
        list: [
          <>
            <strong>Правила підготовки</strong>
            <ul>
              <li>
                - Провести ретельний туалет рук і зовнішніх статевих органів.
              </li>
              <li>
                - Жінки. Для запобігання контамінації сечі виділеннями з піхви,
                перед збором матеріалу бажано вводити тампон. Не слід проводити
                збір сечі під час менструації.
              </li>
              <li>
                - Чоловіки. При сечовипусканні необхідно повністю відтягнути
                шкірну складку, звільнити зовнішній отвір сечовипускного каналу.{" "}
              </li>
            </ul>
            <strong>Правила збору</strong>
            <ul>
              <li>
                - Для дослідження відбирають першу порцію ранкової сечі в
                спеціальний сухий стерильний контейнер об’ємом 50-60 мл.
              </li>
            </ul>
          </>,
        ],
      },
      {
        heading: "Генітальний зішкріб",
        list: [
          <ul>
            <li>- Впродовж 3-х діб виключити статеві контакти/еякуляцію.</li>
            <li>- Протягом 2-3-х годин утриматись від сечовипускання.</li>
            <li>
              - Протягом 14 діб не приймати антибактеріальні/антимікотичні
              препарати .
            </li>
            <li>
              - Забір урогенітального матеріалу на пунктах не проводиться у
              дітей до 18 років (лише приносний матеріал).
            </li>
            <li>
              - Забір потрібно виконувати перед УЗД та іншими інструментальними
              дослідженнями.
            </li>
            <li>- Чоловікам: протягом 3-х діб утриматись від еякуляції.</li>
            <li>
              - Жінкам: протягом 3-х діб виключити спринцювання і постановку
              внутрішньо-вагінальних свічок, мазей, тампонів. Матеріал не можна
              здавати під час менструації (лише через 3 дні після її
              закінчення).
            </li>
          </ul>,
        ],
      },
    ],
  },
  {
    header: "Підготовка до мікроскопічних/цитологічних досліджень",
    content: [
      {
        heading:
          "Мікроскопічне дослідження секрету передміхурової залози (приносний біоматеріал)",
        list: [
          <>
            <strong>Правила підготовки</strong>
            <ul>
              <li>
                - Перед проведенням забору секрету простати необхідно
                відмовитися від вживання алкоголю, гострої їжі, медикаментів.
                Також слід виключити відвідини сауни.
              </li>
              <li>
                - Протягом трьох днів потрібно утримуватися від еякуляції, за
                дві години до забору не мочитися.
              </li>
            </ul>
            <br />
            <strong>Правила забору</strong>
            <li>
              - Забір матеріалу виконує лікар під час проведення масажу простати
              в стерильний контейнер або ж на предметне скло (у разі дослідження
              забарвленого матеріалу).
            </li>
          </>,
        ],
      },
      {
        heading: "Урогенітальний мазок у жінок",
        list: [
          <>
            <ul>
              <li>- Впродовж 3-х діб виключити статеві контакти. </li>
              <li>- Протягом 2-3-х годин утриматись від сечовипускання.</li>
              <li>
                - Протягом 14 діб не приймати антибактеріальні/протигрибкові
                препарати.{" "}
              </li>
              <li>
                - Забір урогенітального матеріалу на пунктах не проводиться у
                дітей до 18 років (лише приносний матеріал).
              </li>
              <li>
                - Протягом 3-х діб виключити спринцювання і постановку
                внутрішньовагінальних свічок, мазей, тампонів. Матеріал не можна
                здавати під час менструації (лише через 3 дні після її
                закінчення).
              </li>
            </ul>
            <strong>Увага!</strong> Забір на дані дослідження виконується
            лікарем, який направляє на дослідження, або за попереднім записом
            персоналом лабораторії за адресою вул. Херсонська 10А,бул. Слави 8
          </>,
        ],
      },
      {
        heading: "Урогенітальний мазок у чоловіків",
        list: [
          <ul>
            <li>- Впродовж 3-х діб виключити статеві контакти/еякуляцію.</li>
            <li>- Протягом 2-3-х годин утриматись від сечовипускання.</li>
            <li>
              - Протягом 14 діб не приймати антибактеріальні/протигрибкові
              препарати.{" "}
            </li>
            <li>
              - Забір урогенітального матеріалу на пунктах не проводиться у
              дітей до 18 років (лише приносний матеріал)
            </li>
          </ul>,
        ],
      },
      {
        heading: "Рідинна цитологія  PAP-ТЕСТ (HURO PATH)",
        list: [
          <ul>
            <li>
              - Оптимальний період для забору матеріалу на скринінг раку шийки
              матки – середня та пізня фолікулінова фаза менструального циклу
              (D31 д.м.ц.), не рекомендовано проводити забір матеріалу під час
              менструації та при гострих запальних процесах
            </li>
            <li>
              - зразки мають бути відібрані до введення будь-яких лікарських
              препаратів, у тому числі оцтової кислоти та розчину Люголю.
            </li>
            <li>
              - За 3 дні виключити статеві контакти та використання вагінальних
              свічок, мазей, тампонів, не приймати ванну.
            </li>
            <li>
              - За 12 годин до забору матеріалу не рекомендується проводити
              туалет статевих органів, їх обробку мазями, присипками та ін.{" "}
            </li>
            <li>
              - Перед забором матеріалу з уретри та перед РАР-тестом утриматись
              від сечовипускання протягом 2 годин.
            </li>
            <li>
              - Забір потрібно виконувати перед УЗД, щоб уникнути потрапляння
              гелю в зразок. (У крайніх випадках, якщо забір здійснюється після
              УЗД, обов’язково ретельно видалити гель тампоном).
            </li>
            <li>
              - Оптимально зібраний зразок має містити клітини ектоцервіксу та
              ендоцервіксу.{" "}
            </li>
            <li>
              Увага! Забір на дані дослідження виконується лікарем, який
              направляє на дослідження, або за попереднім записом персоналом
              лабораторії за адресою вул. Херсонська 10А, бул. Слави 8
            </li>
          </ul>,
        ],
      },
      {
        heading: "Спермограма (Херсонська 10-А)",
        list: [
          <ul>
            <li>
              <strong>Правила підготовки</strong>
            </li>
            <li>
              - Слід утримуватися від еякуляції не менше 48 годин і не більше 5
              днів.
            </li>
            <li>
              - У цей період не можна вживати алкоголь, зокрема пиво, лікарські
              препарати (гормональні, снодійні, заспокійливі), споживати гострі,
              жирні страви і палити.{" "}
            </li>
            <li>
              - Виключити тепловий вплив на зону статевих органів упродовж доби:
              не відвідувати баню або сауну, солярій, не приймати гарячі ванни.
            </li>
            <li>
              - Не рекомендується проводити збір біоматеріалу одразу після УЗД
              та інших інструментальних досліджень урогенітального тракту, а
              також одразу після забору урогенітального зішкрібу.
            </li>
            <li>
              <strong>Правила забору</strong>
            </li>
            <li>
              - Збір тільки на Херсонській 10-А, за попереднім записом або
              приносний матеріал.
            </li>
          </ul>,
        ],
      },
      {
        heading: "Мікроскопічні дослідження біоматеріалу на патогенні гриби",
        list: [
          <ul>
            <li>
              <strong>Волосся:</strong>
            </li>
            <li>
              - Стандартні умови підготовки (якщо інше не визначено лікарем): за
              3 доби припинити застосування будь-яких засобів по догляду за
              волоссям, місцевих лікарських препаратів. В день здачі матеріалу
              не слід мити волосся.
            </li>
            <li>
              <strong>Епідерміс (шкіра):</strong>
            </li>
            <li>
              - Стандартні умови підготовки (якщо інше не визначено лікарем): за
              3 доби припинити застосування будь-яких косметичних засобів
              догляду за шкірою (крем, мило, лосьйони та ін.), припинити
              застосування місцевих лікарських препаратів. В день забору не слід
              мити водою уражену ділянку.
            </li>
            <li>
              <strong>Нігті:</strong>
            </li>
            <li>
              Стандартні умови підготовки (якщо інше не визначено лікарем): за 3
              доби рипинити застосування будь-яких косметичних засобів (лаки,
              засоби для зміцнення нігтів та ін.), місцевих лікарських
              препаратів. В день забору не слід обробляти руки атисептичними
              речовинами та ін.
            </li>
            <li></li>
            <li>
              <strong>Примітки:</strong> Нігті повинні бути чистими і сухими.
              Також не можна перед процедурою обробляти нігті металевою
              пилочкою. Зістригти нігті з обох рук (довжина зрізаних нігтів
              повинна бути не менше 2-х мм). Біоматеріал доставляється в
              стерильному пластиковому контейнері з кришкою, що закручується або
              в паперовому конверті.
            </li>
          </ul>,
        ],
      },
      {
        heading: "Мікроскопічне дослідження на Scabies і демодекс",
        list: [
          <ul>
            <li>
              - За 3 доби варто відмовитись від застосування декоративної
              косметики/мазей/лікарських препаратів, які можуть вплинути на
              результати дослідження.
            </li>
            <li>
              - За добу перед проведенням аналізу не рекомендується проводити
              ретельне очищення, скрабування уражених ділянок шкіри. В день
              забору не слід мити водою уражену ділянку.
            </li>
          </ul>,
        ],
      },
      {
        heading: "Назоцитограма",
        list: [
          <ul>
            Перед забором матеріалу не промивати і не полоскати ніс, не
            закапувати ніс лікарськими препаратами.
          </ul>,
        ],
      },
      {
        heading: "Дослідження мокротиння (приносний матеріал)",
        list: [
          <ul>
            <li>
              - Збір біоматеріалу і його дослідження проводиться до початку
              лікування антибіотиками, антисептиками, протигрибковими
              препаратами або при контролі лікування (після закінчення курсу),
              якщо інше не рекомендовано лікарем.
            </li>
            <li>
              - Рекомендовано для кращого відділення мокротиння напередодні
              дослідження вживати більше рідини. Якщо мокротиння відходить
              погано, пацієнту напередодні дослідження дають відхаркувальні
              препарати або проводять інгаляцію фізіологічним розчином.
            </li>
            <li>
              - Слід виключити прийом їжі, алкоголю, лікарських препаратів,
              паління на протязі 4-х годин до моменту збору.
            </li>
          </ul>,
        ],
      },
    ],
  },
  {
    header: "Кортизол у слині",
    content: [
      {
        heading: "Кортизол у слині",
        list: [
          <ul>
            <li>
              У дiтей рекомендуеться збирати слину цим способом з 5-рiчного вiку
              (для запобігання проковтування тампону). У слинi не повинно бути
              кровi (не проводити дослiдження при загостреннi захворювань
              порожнини рота, не проводити чищення зубiв щiткою або ниткою, не
              вживати їжу i напої перед збором зразка слини впродовж 30 хвилин).
            </li>
            <li>
              - Необхiдно видалити помаду або бальзам для губ. Впродовж 1 години
              перед збором зразку пацiєнт має бути в спокiйному станi (фiзична
              активнiсть або емоцiйне збудження пiдвищують рiвень кортизолу), не
              палити, не жувати жувальну гумку, не чистити зуби. За добу перед
              дослiдженням необхiдно утриматися вiд вживання алкоголю,
              солодкого. Недотримання умов пiдготовки спотворює результат.{" "}
            </li>
            <li>
              - Недоцiльно проводити дослiдження на тлi застосування
              глюкокортикоїдних препаратiв (у т.ч. мазей)/ кровоточення ясен.
            </li>
            <li>
              - Для правильної діагностики слину потрібно збирати точно у
              вказаний лікарем час (зранку о 8.00, о 12:00, вдень о 16.00,
              ввечері о 23.00), оскільки рівень кортизолу в слині має явно
              виражений добовий характер. (за добу 4 порції). Якщо немає iнших
              вказiвок лiкаря, матерiал для дослiдження збирається увечері
              (23.00-24.00), (1 порція).{" "}
            </li>
            <li>- За 10 хвилин до збору слини сполоснуни рот водою.</li>
            <br />
            <li>
              <strong>Правила забору</strong>{" "}
            </li>
            <li>Послідовність дій</li>
            <li>
              1. Вiдкрити кришечку, не витягуючи маленький пластиковий контейнер
              з ватним тампоном.
            </li>
            <li>
              2. Не торкаючись тампона руками, перемiстити його безпосередньо в
              ротову порожнину шляхом нахилу пробiрки до тих пiр, поки тампон не
              випаде в рот.
            </li>
            <li>
              3. Акуратно пожувати тампон, перемiщуючи його в ротовiй порожнинi
              впродовж 2-3 хвилин (не менше, iнакше слини буде недостатньо), щоб
              тампон наповнився слиною.
            </li>
            <li>
              4. Не торкаючись руками до тампона, помiстити його назад у
              внутрiшню маленьку пробiрку, в якiй вiн знаходився.
            </li>
            <li>5. Щiльно закрити контейнер.</li>
          </ul>,
        ],
      },
    ],
  },
  {
    header: "Бактеріологічні дослідження",
    content: [
      {
        heading: "Загальні правила",
        list: [
          <ul>
            <li>
              - Збір біоматеріалу і його дослідження проводиться до початку
              лікування антибіотиками, антисептиками, протигрибковими
              препаратами або при контролі лікування (після закінчення курсу),
              якщо інше не рекомендовано лікарем.
            </li>
            <li>- Без прийому імунобіологічних препаратів - через 5-7 днів</li>
            <li>
              - З прийомом імунобіологічних препаратів - не раніше, ніж через 14
              днів
            </li>
            <li>
              - Антибіотико- та антимікотикограма виконується в тому випадку,
              коли виявлено патогенну/умовно-патогенну мікрофлору, при
              відсутності патогенної і умовно-патогенної мікрофлори антибіотико-
              та антимікотикограми не виконуються.
            </li>
          </ul>,
        ],
      },
      {
        heading: "Бактеріологічне дослідження крові",
        list: [
          <ul>
            <li>
              - Забір крові здійснюється натщесерце, в період гострої
              маніфестації запалення, при підвищеній температурі тіла.
            </li>
            <li>
              - Здавати до, або не раніше ніж через 14 діб після закінчення
              курсу антибактеріальної, антимікотичної терапії, якщо інше не
              рекомендовано лікарем.
            </li>
          </ul>,
        ],
      },
      {
        heading: "Бактеріологічне дослідження сечі",
        list: [
          <ul>
            <li>
              - Збір біоматеріалу і його дослідження проводиться до початку
              лікування антибіотиками, антисептиками, протигрибковими
              препаратами або при контролі лікування (після закінчення курсу),
              якщо інше не рекомендовано лікарем
            </li>
            <li>
              - Не допускається відбирати сечу з постільної білизни або з
              сечоприймача.{" "}
            </li>
            <li>
              - Катетеризація сечового міхура для рутинного дослідження не
              застосовується, оскільки вона може привести до інфікування
              сечовивідних шляхів. До катетеризації сечового міхура вдаються в
              деяких випадках для уточнення локалізації інфекції - в сечовому
              міхурі або у нирках. З цією метою сечовий міхур звільняють
              катетером і промивають розчином антибіотика, після чого з
              інтервалом в 10 хвилин беруть проби сечі для дослідження. Якщо
              інфекція локалізується у нирках, мікроорганізми містяться в усіх
              порціях сечі. При інфекції сечового міхура сеча залишається
              стерильною.
            </li>
            <li>
              - На ємності обов'язково вказують ПІБ пацінта, дату та час збору
              матеріалу.
            </li>
          </ul>,
        ],
      },
      {
        heading:
          "Бактеріологічне дослідження на дисбіоз кишківника, бактеріологічне дослідження калу на патогенну мікрофлору",
        list: [
          <ul>
            <li>
              - За 1-3 дні до взяття біоматеріалу потрібно дотримуватись дієти,
              що виключає вживання продуктів, які посилюють процеси бродіння в
              кишківнику, молочно-кислі продукти, а також алкоголь, антибіотики
              і препарати, які містять біфідобактерії, лактобактерії, тощо.
            </li>
            <li>
              - Не можна проводити копрологічні дослідження після клізми. Після
              рентгенологічного дослідження шлунку та кишківника проведення
              аналізу калу показане не раніше, ніж через дві доби.
            </li>
            <li>
              - При контролі лікування (перед початком лікування та після
              закінчення курсу лікування): - з прийомом антибактеріальних,
              імунобіологічних, протигрибкових препаратів – не раніше, ніж через
              14 днів, якщо інше не рекомендовано лікарем.
            </li>
          </ul>,
        ],
      },
      {
        heading: "Бактеріологічне дослідження урогенітальних виділень (жінки)",
        list: [
          <ul>
            <li>
              - Забір біоматеріалу і його дослідження проводиться до початку
              лікування антибіотиками, антисептиками, протигрибковими
              препаратами або при контролі лікування (7-10 діб після закінчення
              курсу), якщо інше не рекомендовано лікарем.
            </li>
            <li>
              - Впродовж 3-х діб виключити статеві контакти і постановку
              внутрішньо-вагінальних свічок, мазей, тампонів.{" "}
            </li>
            <li>- Протягом 3 годин утриматись від сечовипускання.</li>
            <li>
              - Забір урогенітального матеріалу в лабораторному центрі не
              проводиться у дітей до 18 років (лише приносний матеріал).{" "}
            </li>
            <li>
              - Матеріал не можна здавати під час менструації (тільки через 3
              дні після її закінчення).
            </li>
          </ul>,
        ],
      },
      {
        heading:
          "Бактеріологічне дослідження урогенітальних виділень (чоловіки)",
        list: [
          <ul>
            <li>
              - Забір біоматеріалу і його дослідження проводиться до початку
              лікування антибіотиками, антисептиками, протигрибковими
              препаратами або при контролі лікування (7-10 діб після закінчення
              курсу), якщо інше не рекомендовано лікарем.
            </li>
            <li>
              - Впродовж 3 -х діб виключити статеві контакти, сім’явиверження.
            </li>
            <li>- Протягом 3 годин утриматись від сечовипускання.</li>
            <li>
              - Забір урогенітального матеріалу в лабораторному центрі не
              проводиться у дітей до 18 років (лише приносний матеріал).
            </li>
          </ul>,
        ],
      },
      {
        heading: "Бактеріологічне дослідження виділень зіву",
        list: [
          <ul>
            <li>
              - Забір біоматеріалу проводиться натщесерце або через 4 години
              після прийому їжі.
            </li>
            <li>
              - Перед забором не полоскати рот і горло, не чистити зуби, не
              курити.
            </li>
            <li>
              - Упродовж доби перед забором матеріалу не застосовувати місцеві
              препарати.{" "}
            </li>
            <li>
              - Забір проводити до, або не раніше ніж через 14 діб після
              закінчення курсу антибактеріальної, антимікотичної терапії, якщо
              інше не рекомендовано лікарем.
            </li>
          </ul>,
        ],
      },
      {
        heading: "Бактеріологічне дослідження виділень носу",
        list: [
          <ul>
            <li>- Перед забором не полоскати носові ходи.</li>
            <li>
              - Упродовж доби перед забором матеріалу не застосовувати місцеві
              препарати/каплі.{" "}
            </li>
            <li>
              - Здавати до, або не раніше ніж через 14 діб після закінчення
              курсу антибактеріальної, антимікотичної терапії, якщо інше не
              рекомендовано лікарем.
            </li>
          </ul>,
        ],
      },
      {
        heading: "Бактеріологічне дослідження виділень ока",
        list: [
          <ul>
            <li>
              - Забір біоматеріалу і його дослідження проводиться до початку
              лікування антибіотиками, антисептиками, протигрибковими
              препаратами або при контролі лікування (7-10 діб після закінчення
              курсу), якщо інше не рекомендовано лікарем.
            </li>
            <li>
              - Напередодні, за 6-8 год. (ніч) до забору матеріалу, відміняють
              всі медикаменти та процедури (загальні і місцеві).
            </li>
            <li>
              - В день взяття матеріалу - не вмиватися, а саме не умивати очі.
            </li>
            <li>- Не фарбувати вії.</li>
          </ul>,
        ],
      },
      {
        heading: "Бактеріологічне дослідження виділень із вуха",
        list: [
          <ul>
            <li>
              - Забір біоматеріалу і його дослідження проводиться до початку
              лікування антибіотиками, антисептиками, протигрибковими
              препаратами або при контролі лікування (7-10 діб після закінчення
              курсу), якщо інше не рекомендовано лікарем.
            </li>
            <li>
              - Напередодні, за 6-8 год. (ніч) до забору матеріалу, відміняють
              всі медикаменти та процедури (загальні і місцеві).
            </li>
            <li>- За 2-3 дні до забору біоматеріалу не чистити вуха.</li>
          </ul>,
        ],
      },
      {
        heading: "Бактеріологічне дослідження грудного молока",
        list: [
          <ul>
            <li>
              - Збір біоматеріалу і його дослідження проводиться до початку
              лікування антибіотиками, антисептиками, протигрибковими
              препаратами або при контролі лікування (7-10 діб після закінчення
              курсу), якщо інше не рекомендовано лікарем.
            </li>
          </ul>,
        ],
      },
      {
        heading: "Бактеріологічне дослідження сперми",
        list: [
          <ul>
            <li>
              - Збір біоматеріалу і його дослідження проводиться до початку
              лікування антибіотиками, антисептиками, протигрибковими
              препаратами або при контролі лікування (7-10 діб після закінчення
              курсу), якщо інше не рекомендовано лікарем.
            </li>
            <li>
              - Протягом 3-х діб утриматись від статевих актів та
              сім’явиверження.{" "}
            </li>
            <li>
              - Виключити тепловий вплив на область статевих органів впродовж
              доби (лазня, сауна).
            </li>
          </ul>,
        ],
      },
      {
        heading:
          "Бактеріологічне дослідження інфікованої рани (приносний матеріал)",
        list: [
          <ul>
            <li>
              - Збір біоматеріалу і його дослідження проводиться до початку
              лікування антибіотиками, антисептиками, протигрибковими
              препаратами або при контролі лікування (7-10 діб після закінчення
              курсу), якщо інше не рекомендовано лікарем.
            </li>
            <li>
              - Напередодні, за 6-8 годин до забору біоматеріалу відміняють усі
              медикаменти, процедури, антибактеріальні пов’язки.
            </li>
            <li>
              - Забір матеріалу для бактеріологічного дослідження виконує лише
              лікар.
            </li>
          </ul>,
        ],
      },
      {
        heading:
          "Бактеріологічне дослідження синовіальної рідини (приносний матеріал)",
        list: [
          <ul>
            <li>
              - Збір біоматеріалу і його дослідження проводиться до початку
              лікування антибіотиками, антисептиками, протигрибковими
              препаратами або при контролі лікування (7-10 діб після закінчення
              курсу), якщо інше не рекомендовано лікарем.
            </li>
            <li>
              - Взяття матеріалу для бактеріологічного дослідження виконує лише
              лікар.
            </li>
            <br />
            <strong>
              Матеріал доставляється у лабораторію у стерильному контейнері.
            </strong>
          </ul>,
        ],
      },
      {
        heading:
          "Бактеріологічне дослідження на патогенні гриби (приносний матеріал)",
        list: [
          <ul>
            <li>
              - Збір біоматеріалу і його дослідження проводиться до початку
              лікування антибіотиками, антисептиками, протигрибковими
              препаратами або при контролі лікування (10-14 діб після закінчення
              курсу), якщо інше не рекомендовано лікарем.
            </li>
            <strong>Волосся: </strong>
            <li>
              - Стандартні умови підготовки (якщо інше не визначено лікарем): за
              3 доби припинити застосування будь-яких засобів по догляду за
              волоссям, місцевих лікарських препаратів. В день здачі матеріалу
              не слід мити волосся.
            </li>
            <strong>Епідерміс (шкіра):</strong>
            <li>
              - Стандартні умови підготовки (якщо інше не визначено лікарем):
              припинити застосування будь-яких косметичних засобів догляду за
              шкірою (крем, мило, лосьйони та ін.), припинити застосування
              місцевих лікарських препаратів. В день здачі не слід мити водою
              уражену ділянку.
            </li>
            <strong>Нігті: </strong>
            <li>
              - Стандартні умови підготовки (якщо інше не визначено лікарем):
              Припинити застосування будь-яких косметичних засобів (лаки, засоби
              для зміцнення нігтів та ін.), місцевих лікарських препаратів. В
              день здачі не слід обробляти руки антисептичними речовинами та ін.
            </li>
            <li>
              - Нігті повинні бути чистими і сухими. Також не можна перед
              процедурою обробляти нігті металевою пилочкою. Зістригти нігті з
              обох рук (довжина зрізаних нігтів повинна бути не менше 2-х мм).
              Біоматеріал доставляється в стерильному пластиковому контейнері з
              кришкою, що закручується або в паперовому конверті
            </li>
          </ul>,
        ],
      },
      {
        heading: "Бактеріологічне дослідження мокротиння",
        list: [
          <ul>
            <li>
              - Збір біоматеріалу і його дослідження проводиться до початку
              лікування антибіотиками, антисептиками, протигрибковими
              препаратами або при контролі лікування (7-10 діб після закінчення
              курсу), якщо інше не рекомендовано лікарем.
            </li>
            <li>
              - Рекомендовано для кращого відділення мокротиння напередодні
              дослідження вживати більше рідини. Якщо мокротиння відходить
              погано, пацієнту напередодні дослідження дають відхаркувальні
              препарати або проводять інгаляцію фізіологічним розчином.{" "}
            </li>
            <li>
              - Слід виключити прийом їжі, алкоголю, лікарських препаратів,
              паління на протязі 4-х годин до моменту збору.
            </li>
          </ul>,
        ],
      },
    ],
  },
]

const items2: AccordionItem[] = [
  {
    header: "Правила збору сечі",
    content: [
      {
        heading: "Інструкції зі збору разової порції сечі",
        list: [
          "Перші дві секунди сечовипускання слід випустити в унітаз, після чого, не перериваючи процесу сечовипускання, підставити спеціальний контейнер для збору сечі і зібрати не менше 50 мл сечі",
          "Проміжок часу між збором біоматеріалу та його доставкою в лабораторію повинен бути мінімальним. У разі, якщо у Вас немає можливості одразу доставити матеріал в лабораторію, контейнер з сечею слід зберігати в холодильнику (на нижній полиці), не допускаючи заморожування",
          "Для точних результатів загального аналізу сечі, по Нечипоренко слід збирати ранкову порцію сечі, яка протягом ночі накопичується в сечовому міхурі",
          "Для отримання максимально точних результатів рекомендується здавати сечу не більше ніж на одне дослідження в день",
        ],
      },
      {
        heading: "Інструкції зі збору добової сечі без консерванту",
        list: [
          "Добова сеча - це весь діурез, зібраний за 24 години",
          "Перше сечовипускання після пробудження не вимагає збору. Необхідно повністю спустошити сечовий міхур, і почати відлік часу",
          "Усі наступні порції сечі слід збирати в одну чисту ємність (бажано кілька разів вимити ємність і обполоснути її кип'яченою водою)",
          "Протягом всього періоду збору сечі ємність слід зберігати при температурі +4 С ° - + 8С ° (бажано на нижній полиці холодильника)",
          "Після того, як добовий діурез зібрано, слід перемішати вміст ємності, виміряти об'єм сечі і записати отримані дані в бланку-напрямку. Наприклад, 1000 мл сечі/доба",
          "Не слід приносити всю ємність в лабораторію. Необхідна кількість біоматеріалу для вивчення - 10-15 мл",
        ],
      },
      {
        heading: "Інструкції зі збору добової сечі з консервантом",
        list: [
          "Сеча збирається в спеціальну ємність з додаванням консерванту. Консервант використовується з метою підкислення зразка сечі",
          "Ємність з консервантом можна отримати в лабораторії VitaLab",
          "Ніякої спеціальної підготовки до добового аналізу сечі не потрібно",
          "Перше сечовипускання після пробудження не вимагає збору. Необхідно повністю спустошити сечовий міхур, і почати відлік часу",
          "Всі останні порції сечі слід збирати в одну чисту ємність (бажано кілька разів вимити ємність і обполоснути її кип'яченою водою)",
          "Протягом всього періоду збору сечі ємність слід зберігати при температурі +4 С ° - +8 С ° (бажано на нижній полиці холодильника)",
          "Після того, як добовий діурез зібрано, слід перемішати вміст ємності, виміряти об'єм сечі і записати отримані дані в бланку-напрямку. Наприклад, 1000 мл сечі/доба",
          "Не слід приносити всю ємність в лабораторію. Необхідна кількість матеріалу для вивчення - 10-15 мл",
        ],
      },
    ],
  },
  {
    header: "Інструкції зі збору зразків калу",
    content: [
      {
        list: [
          "У спеціальний одноразовий пластиковий контейнер (можна отримати в лабораторії) збирається зразок калу, розміром з квасолину",
          "Зразок треба збирати з 4 точок і тільки зі свіжого стільця",
          "Контейнер з біоматеріалом слід здати в лабораторію для подальших досліджень в найкоротші терміни. В крайньому випадку, припускається нетривале зберігання в холодильнику",
        ],
      },
      {
        heading: `Інструкції зі збору калу для "Мікробіологічного дослідження на дисбактеріоз"`,
        list: [
          "Кал необхідно зібрати в одноразовий пластиковий контейнер",
          "Перед збором калу на аналіз, спочатку помочіться в унітаз, потім після дефекації зберіть матеріал (з 4 точок) за допомогою спеціальної ложечки та помістіть в контейнер",
          "Контейнер для зразків матеріалу для мікробіологічного дослідження на дисбактеріоз Ви повинні взяти в лабораторії",
          "Рекомендується дотримуватися правил антисептики під час збору матеріалу",
        ],
      },
    ],
  },
  {
    header: "Інструкції зі збору мокротиння",
    content: [
      {
        list: [
          "Мокротиння збирається за допомогою відкашлювання. Для проведення вивчень потрібно зібрати не менше 1 мл біоматеріалу в відповідну ємність",
          "Зібраний матеріал необхідно доставити в лабораторію в найкоротші терміни (не більше 3 годин з моменту збору), дотримуючись температурного режиму",
        ],
      },
    ],
  },
  {
    header:
      "Інструкції зі збору еякуляту (для мікробіологічних та плр досліджень)",
    content: [
      {
        list: [
          "Ретельно вимити руки з милом",
          "Провести належний туалет статевих органів",
          "Висушити головку статевого члена і крайню плоть",
          "Зібрати еякулят (шляхом мастурбації) в контейнер і доставити його в лабораторію, дотримуючись температурного режиму",
        ],
      },
    ],
  },
  {
    header: "Інструкції зі збору волосся",
    content: [
      {
        list: [
          "Для проведення дослідження необхідні невеликі пучки волосся з задніх скроневих, задньої тім'яної, та потиличної областей голови",
          "Пучки волосся довжиною 3 см необхідно зрізати максимально близько до кореня",
          "У разі, якщо зрізане волосся коротке, слід зібрати його в обсязі 500 мг (чайна ложка)",
          "Матеріал помістити в пакет",
          "Доставити пакет з біоматеріалом в лабораторію дотримуючись кімнатної температури",
        ],
      },
    ],
  },
  {
    header: "Інструкції зі збору нігтів",
    content: [
      {
        list: [
          "При підготовці до дослідження нігтів слід виключити використання лікарських і косметичних засобів",
          "Збір підозрілих і уражених ділянок нігтя з периферії осередку ураження може проводитися як пацієнтом, так і лікарем",
          "Якщо збір матеріалу проводиться Вами, то слід зрізати уражені ділянки нігтя за допомогою ножиць, і помістити в спеціальний контейнер",
          "Лікар здійснює збір матеріалу за допомогою стерильних медичних інструментів і поміщає його в контейнер",
          "Зібрані зразки потрібно доставити в лабораторію, дотримуючись температурного режиму",
        ],
      },
    ],
  },
]

// const AccordionTrigger = React.forwardRef<
//   React.ElementRef<typeof AccordionPrimitive.Trigger>,
//   React.ComponentPropsWithoutRef<typeof AccordionPrimitive.Trigger>
// >(({ className, children, ...props }, ref) => (
//   <AccordionPrimitive.Header className="flex">
//     <AccordionPrimitive.Trigger
//       ref={ref}
//       className={cn(
//         "flex flex-1 items-center justify-between py-4 font-medium transition-all hover:underline [&[data-state=open]>svg]:rotate-180",
//         className
//       )}
//       {...props}
//     >
//       {children}
//       <ChevronDown className="h-4 w-4 transition-transform duration-200" />
//     </AccordionPrimitive.Trigger>
//   </AccordionPrimitive.Header>
// ))

function AccordionSubTrigger({ children }) {
  return (
    <AccordionPrimitive.Header className="flex">
      <AccordionPrimitive.Trigger className="flex flex-1 items-center justify-between py-1 font-medium transition-all hover:no-underline [&[data-state=open]>div>h2]:opacity-100">
        {children}
        {/* <Eye className="h-5 w-5 transition-transform duration-200" /> */}
      </AccordionPrimitive.Trigger>
    </AccordionPrimitive.Header>
  )
}

const Preparation = () => {
  return (
    <>
      <Head
        title="Підготовка до здачі аналізів - українська медична лабораторія VitaLab"
        description="Медичні лабораторні дослідження у Дніпрі. Понад 400 аналізів. Європейське обладнання та стандарти якості."
      />
      <Section>
        <div className="mt-9 md:mt-0 md:pb-24">
          <div
            className="section__row-layout gap-16"
            // style={
            //   {
            //     "--row-layout-gap": `var(--row-layout-gap-xlarge)`,
            //   } as React.CSSProperties
            // }
          >
            <Breadcrumbs title={"Як здавати"} />
            <div
              className="section__row-layout"
              style={
                {
                  "--row-layout-gap": `var(--row-layout-gap-large)`,
                } as React.CSSProperties
              }
            >
              <div className="px-4 sm:pr-16 lg:pr-28">
                <Heading variant="pageHeading" className="mb-6 font-semibold">
                  Підготовка до здачі аналізів
                </Heading>
                <p className="text-lg text-slate-900">
                  Рекомендації Вашого лікаря є пріоритетними для дотримання.
                </p>
              </div>
              <AccordionPrimitive.Root
                className="relative border-t border-t-[#e7ecf1]" //border
                type="single"
                collapsible
              >
                {items.map(({ header, content }, i) => (
                  <AccordionPrimitive.Item
                    key={`header-${i}`}
                    value={`item-${i + 1}`}
                    className="relative border-b border-b-[#e7ecf1]"
                  >
                    <AccordionPrimitive.Header className="border-x radix-state-open:border-b">
                      <AccordionPrimitive.Trigger className="group flex w-full items-center justify-between gap-4 bg-[#ffffff] p-4 text-left transition ease-hover">
                        <span className="text-m font-semibold text-[#0a2540] transition ease-hover group-hover:opacity-60">
                          {header}
                        </span>
                        {/* <AccordionChevron aria-hidden /> */}
                        <ChevronDownIcon
                          className={clsx(
                            "ml-2 h-5 w-5 shrink-0 text-gray-700 ease-in-out",
                            "group-radix-state-open:rotate-180 group-radix-state-open:duration-300"
                          )}
                        />
                      </AccordionPrimitive.Trigger>
                    </AccordionPrimitive.Header>
                    {content.map((item: any) => (
                      <AccordionPrimitive.Content key={item}>
                        <div
                          className="section__row-layout py-2 pr-4"
                          style={
                            {
                              "--row-layout-gap": `var(--row-layout-gap-large)`,
                            } as React.CSSProperties
                          }
                        >
                          <Accordion type="single" collapsible>
                            <AccordionItem
                              value="item-1"
                              className="border-b-0"
                            >
                              <AccordionSubTrigger className="py-1 hover:no-underline">
                                <div className="w-11/12 px-4 sm:pr-8">
                                  <Heading
                                    variant="sectionHeading"
                                    className="text-left font-normal transition-opacity hover:opacity-60"
                                  >
                                    {item.heading}
                                  </Heading>
                                </div>
                              </AccordionSubTrigger>
                              <AccordionContent>
                                <div
                                  className={clsx(
                                    "pr-4 pl-4 sm:pr-8 md:col-span-4",
                                    {
                                      "md:col-start-2": item.heading,
                                    }
                                  )}
                                >
                                  <ul className="space-y-2 text-m text-gray-800">
                                    {item.list.map((list: any) => (
                                      <li key={list}>{list}</li>
                                    ))}
                                  </ul>
                                </div>
                              </AccordionContent>
                            </AccordionItem>
                          </Accordion>
                          {/* <div className="grid items-start gap-y-2 md:grid-cols-4 md:gap-y-8">
                            {item.heading && (
                              <div className="px-4 sm:pr-8">
                                <Heading variant="sectionHeading">
                                  {item.heading}
                                </Heading>
                              </div>
                            )}
                            <div
                              className={clsx(
                                "pr-4 pl-4 sm:pr-8 md:col-span-4",
                                {
                                  "md:col-start-2": item.heading,
                                }
                              )}
                            >
                              <ul className="space-y-2 text-m text-gray-800">
                                {item.list.map((list: any) => (
                                  <li key={list}>{list}</li>
                                ))}
                              </ul>
                            </div>
                          </div> */}
                        </div>
                      </AccordionPrimitive.Content>
                    ))}
                  </AccordionPrimitive.Item>
                ))}
              </AccordionPrimitive.Root>
            </div>
          </div>
        </div>
      </Section>
      <AdBlock />
      {/* <Section>
        <div className="py-32">
          <div
            className="section__row-layout"
            style={
              {
                "--row-layout-gap": `var(--row-layout-gap-xlarge)`,
              } as React.CSSProperties
            }
          >
            <div className="relative flex overflow-hidden rounded-lg bg-orange-500 shadow-2xl">
              <div
                className="pointer-events-none absolute top-0 left-0 h-full w-full"
                style={
                  {
                    "mask-image":
                      "linear-gradient(270deg, rgba(0,0,0,0.45) calc(50%*-1),transparent 50%)",
                    "-webkit-mask-image":
                      "linear-gradient(270deg, rgba(0,0,0,0.45) calc(50%*-1),transparent 50%)",
                  } as React.CSSProperties
                }
              >
                <div
                  className="absolute top-0 left-0 h-full w-full bg-contain bg-right bg-no-repeat"
                  style={
                    {
                      "background-image": `url(${car.src})`,
                      // "background-position": "100% 50%",
                      // "background-size": "auto 100%",
                      // "background-repeat": "no-repeat",
                      // transform: "translateZ(0)",
                    } as React.CSSProperties
                  }
                ></div>
              </div>
             <div className="flex min-h-[300px] w-full">
                <div className="relative flex min-w-full">
                  <div className="flex min-h-[290px] flex-col-reverse text-white md:grid md:h-full md:grid-cols-2">
                    <div className="items-start justify-center p-12 pt-0 text-lg font-normal leading-[1.55] md:flex md:flex-col md:pt-12 md:pr-0">
                      <p>
                        VitaLab пропонує опцію «Забір біологічного матеріалу
                        вдома (в офісі)». Така опція буде кращим рішенням для
                        людей, які за певних обставин не можуть прийти до
                        відділення лабораторії.
                        <br /> Ви можете обрати термін приїзду мобільної команди
                        самостійно.
                      </p>
                      <p className="mt-4">
                        Щоб викликати нашу медсестру зателефонуйте:
                        <br /> <a href="tel:+380673105227">(067) 310-52-27</a>,
                        <a href="tel:+380503607575"> (050) 360-75-75</a>,
                        <a href="tel:+380632510338"> (063) 251-03-38</a>
                      </p>
                    </div>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </Section> */}
    </>
  )
}

Preparation.getLayout = (page: ReactElement) => {
  return <Layout>{page}</Layout>
}

export default Preparation
