import { use, useState } from "react"
import { useRouter } from "next/router"
import { Layout } from "@components/common"
import { TermsCheckbox } from "@components/molecules/terms-checkbox"
import { Card, Section } from "@components/ui"
import { Button } from "@components/v2/button"
import { medusaClient } from "@lib/config"
import { useAccount } from "@lib/context/account-context"
import LoginTemplate from "@modules/account/templates/login-template"
import Head from "@modules/common/components/head"
import { api } from "@utils/api"
import { useAtomValue } from "jotai"
import { userDataAtom, userPhoneAtom } from "stores/user-data-store"
import type { NextPageWithLayout } from "types/global"
import { z } from "zod"

const Tos: NextPageWithLayout = () => {
  const userData = useAtomValue(userDataAtom)
  const userPhone = useAtomValue(userPhoneAtom)
  const [checked, setChecked] = useState(false)
  const { refetchCustomer } = useAccount()
  const router = useRouter()
  const mutation = api.customer.create.useMutation({
    onSuccess: (data) => {
      refetchCustomer()
      medusaClient.auth.authenticate({
        email: data.email,
        password: data.password,
      })
      router.push("/account/orders")
    },
    onError: (error) => {
      console.log(error.message)
    },
  })

  // if (userData.firstName === "") {
  //   router.push("/account")
  // }

  return (
    <>
      <Head title="Sign in" description="Sign in to your ACME account." />
      <Section>
        <div className="pb-16">
          <div
            className="section__row-layout"
            style={
              {
                "--row-layout-gap": `var(--row-layout-gap-small)`,
              } as React.CSSProperties
            }
          >
            <div className="mt-14 grid grid-cols-1 sm:mt-20 md:grid-cols-4">
              <div className="col-span-4 md:min-h-[530px]">
                <Card shadow="medium" className="bg-white">
                  <div className="p-4">
                    <div className="mr-2 space-y-2 px-6 text-xs">
                      <h2 className="my-6 text-lg font-semibold">
                        ПУБЛІЧНИЙ ДОГОВІР ПРО НАДАННЯ МЕДИЧНИХ ПОСЛУГ (ПУБЛІЧНА
                        ОФЕРТА) 01.05.2023
                      </h2>
                      <p>
                        Товариство з обмеженою відповідальністю «Діагностичний
                        лабораторний центр «ВIТАЛАБ» (далі – «Виконавець»), з
                        однієї сторони,
                      </p>
                      <p>
                        та Фізична особа (далі – «Замовник» та/або «Пацієнт»),
                        яка на платній основі замовляє послуги з лабораторної
                        діагностики на сайті{" "}
                        <a href="http://vitalab.com.ua">
                          http://vitalab.com.ua
                        </a>
                        , з другої сторони,
                      </p>
                      <p>
                        надалі разом іменуються «Сторони», а кожен окремо –
                        «Сторона», уклали цей Публічний договір про надання
                        медичних послуг (далі – «Договір») про таке:
                      </p>
                      <p>
                        <strong>1. ВИЗНАЧЕННЯ ПОНЯТЬ</strong>
                      </p>
                      <p>
                        1.1 Замовник - фізична особа, яка володіє повною
                        цивільною дієздатністю та розмістила Замовлення на сайті
                        Виконавця за адресою:{" "}
                        <a href="http://vitalab.com.ua">
                          http://vitalab.com.ua
                        </a>
                        . Замовник може розмістити Замовлення на свою користь та
                        бути безпосереднім отримувачем Послуг Виконавця та/або
                        розмістити Замовлення на користь третьої особи, яку він
                        представляє відповідно до договору чи закону, та яка
                        буде безпосереднім отримувачем Послуг Виконавця.
                      </p>
                      <p>
                        1.2 Пацієнт - фізична особа, яка є безпосереднім
                        отримувачем Послуг Виконавця, та на користь якої
                        оформлене Замовлення на сайті Виконавця за адресою:{" "}
                        <a href="http://vitalab.com.ua">
                          http://vitalab.com.ua
                        </a>
                        .
                      </p>
                      <p>
                        1.3 Виконавець – ТОВ «Діагностичний лабораторний центр
                        «ВIТАЛАБ».
                      </p>
                      <p>
                        1.4 Послуга – медичні лабораторні дослідження
                        (лабораторна діагностика), що здійснюється Виконавцем
                        відповідно до Замовлення, яке оформлене на сайті
                        Виконавця за адресою:{" "}
                        <a href="http://vitalab.com.ua">
                          http://vitalab.com.ua
                        </a>{" "}
                        та складається з наступних етапів: інформування щодо
                        підготовки до обстеження, взяття біологічного матеріалу
                        безпосередньо в місці знаходження Виконавця чи за місцем
                        знаходження Пацієнта, проведення лабораторного
                        дослідження, оформлення результату лабораторного
                        дослідження та надання результату лабораторного
                        дослідження.
                      </p>
                      <p>
                        1.5 Замовлення - запит Замовника, оформлений на сайті
                        Виконавця{" "}
                        <a href="http://vitalab.com.ua">
                          http://vitalab.com.ua
                        </a>
                        , в якому визначений перелік замовлених Послуг, дані
                        особи Пацієнта, місце отримання Послуг та інша
                        інформація, яка необхідна Виконавцю для надання Послуг
                        за таким Замовленням.
                      </p>
                      <p>
                        1.6 Акцепт – повне та беззастережне прийняття Замовником
                        умов даного Договору, що здійснюється шляхом оформлення
                        Замовлення на сайті Виконавця, подальшого надання згоди
                        на обробку персональних даних, ознайомлення та
                        погодження з Правилами підготовки пацієнта перед
                        відбором зразка біологічного матеріалу та проведення
                        оплати послуг Виконавця.
                      </p>
                      <p>
                        1.7 Публічна оферта - пропозиція Виконавця, що викладена
                        на сайті Виконавця{" "}
                        <a href="http://vitalab.com.ua">
                          http://vitalab.com.ua
                        </a>
                        , укласти даний Договір на визначених умовах, адресована
                        необмеженому колу фізичних осіб.
                      </p>
                      <p>
                        1.8 Сайт Виконавця - веб-сторінка в мережі Інтернет, яка
                        знаходиться за веб-адресою:{" "}
                        <a href="http://vitalab.com.ua">
                          http://vitalab.com.ua
                        </a>{" "}
                        та яка є офіційним джерелом інформування Замовників про
                        Виконавця та Послуги, що ним надаються.
                      </p>
                      <p>
                        <strong>2. ЗАГАЛЬНІ ПОЛОЖЕННЯ</strong>
                      </p>
                      <p>
                        2.1 Даний Договір є публічним договором відповідно до
                        ст. 633, ст. 634. ст. 641 Цивільного кодексу України,
                        який вважається укладеним між Виконавцем з однієї
                        сторони та Замовником з другої сторони, з моменту
                        Акцепту останнім всіх без винятку умов та положень
                        даного Договору. Даний Договір може бути договором, що
                        укладений на користь третьої особи в розумінні ст. 636
                        Цивільного кодексу України.
                      </p>
                      <p>
                        2.2 Умови цього Договору є однаковими та обов’язковими
                        для всіх Замовників та/або Пацієнтів, які оформили
                        Замовлення Послуги та здійснили оплату через Сайт
                        Виконавця.
                      </p>
                      <p>
                        2.3 Договором визначаються порядок та умови надання
                        Виконавцем Послуг за Замовленням, яке оформлене на Сайті
                        Виконавця.
                      </p>
                      <p>
                        2.4 З метою укладення даного Договору Замовник здійснює
                        його Акцепт, тобто надає свою повну, добровільну та
                        беззастережну згоду на укладення Договору на умовах,
                        визначених Виконавцем. Згодою Замовника на укладення
                        даного Договору вважається вчинення Замовником дій,
                        перелік та послідовність яких чітко роз’яснений на Сайті
                        Виконавця, та які спрямовані на оформлення Замовлення з
                        метою отримання Послуг за цим Договором, підтвердження
                        погодження з умовами Договору та Додаткових угод та/або
                        Додатків до нього та оплати Послуг, що включені до
                        Замовлення.
                      </p>
                      <p>
                        2.5 Цей Договір вважається укладеним з моменту
                        безумовного підтвердження прийняття умов даного Договору
                        (акцепту) та здійснення Замовником дій щодо оформлення
                        Замовлення, підтвердження Договору та Додаткових угод до
                        нього та оплати Послуг, що включені до Замовлення в
                        порядку визначеному Договором. З цього моменту Договір
                        вважається укладеним без його підписання.
                      </p>
                      <p>
                        <strong>3. ПРЕДМЕТ ДОГОВОРУ</strong>
                      </p>
                      <p>
                        3.1 В порядку та на умовах, визначених цим Договором,
                        Виконавець зобов’язується за Замовленням Замовника
                        надати Пацієнту Послуги відповідно до Замовлення, а
                        Замовник в свою чергу зобов’язується оплатити, а Пацієнт
                        прийняти Послуги, відповідно до умов даного Договору.
                      </p>
                      <p>
                        3.2 Послуги надаються Виконавцем належної якості, в
                        установлені строки та в порядку, визначеному цим
                        Договором, іншими внутрішніми стандартами та положеннями
                        Виконавця, а також чинним законодавством України.
                      </p>
                      <p>
                        3.3 Замовник підтверджує, що його волевиявлення на
                        укладення цього Договору є вільним, відповідає його
                        внутрішній волі та спрямоване на реальне настання
                        правових наслідків.
                      </p>
                      <p>
                        <strong>4. ПРАВА ТА ОБОВ’ЯЗКИ СТОРІН</strong>
                      </p>
                      <p>4.1 Замовник та/або Пацієнт має право:</p>
                      <p>
                        4.1.1 На надання якісних Послуг відповідно до
                        оформленого Замовлення за цим Договором.
                      </p>
                      <p>
                        4.1.2 Отримувати необхідну та достовірну інформацію про
                        Виконавця, його діяльність, обсяг Послуг, що ним
                        надаються.
                      </p>
                      <p>
                        4.1.3 Обирати спосіб оплати Замовлення з-поміж тих, що
                        запропоновані Виконавцем та інформація про які міститься
                        у відкритому доступі на Сайті Виконавця.
                      </p>
                      <p>
                        4.1.4 Обирати Послугу, що має бути надана Виконавцем,
                        з-поміж тих, що пропонуються Виконавцем та інформація
                        про які міститься у відкритому доступі на Сайті
                        Виконавця.
                      </p>
                      <p>
                        4.1.5 Скасувати Замовлення у порядку, встановленому цим
                        Договором.
                      </p>
                      <p>
                        4.1.6 Подавати Виконавцю скарги, відгуки, зауваження,
                        пропозиції, заяви щодо Послуг, які надаються Виконавцем
                        за цим Договором.
                      </p>
                      <p>
                        4.1.7 Уповноважити лікаря, що надає йому медичну
                        допомогу, формувати і передавати Виконавцю направлення
                        на проведення медичних досліджень.
                      </p>
                      <p>4.2 Замовник та/або Пацієнт зобов’язаний:</p>
                      <p>
                        4.2.1 Надавати Виконавцю достовірні особисті дані та
                        іншу інформацію, необхідну для виконання умов даного
                        Договору. У випадку, якщо Замовник діє в інтересах
                        Пацієнта, Замовник зобов’язаний надавати повні та
                        достовірні відомості про Пацієнта.
                      </p>
                      <p>
                        4.2.2 Забезпечити можливість здійснення взяття
                        біологічного матеріалу Пацієнта працівниками Виконавця в
                        приміщенні Виконавця протягом 30-ти календарних днів з
                        моменту оформлення та оплати Замовлення, або в інший
                        строк, зазначений Виконавцем у Замовленні. В разі
                        невиконання Замовником даного зобов’язання Виконавець
                        має право анулювати його Замовлення, при цьому, кошти
                        оплачені за Послугу не повертаються Замовнику.
                      </p>
                      <p>
                        4.2.3 Неухильно дотримуватись умов цього Договору, а в
                        разі настання обставин, що перешкоджають дотриманню умов
                        Договору та належному його виконанню, негайно, в
                        розумний строк повідомити про це Виконавця.
                      </p>
                      <p>
                        4.2.4 На вимогу Виконавця надавати інформовану
                        добровільну згоду на проведення медичного втручання
                        та/або згоду на обробку персональних даних та/або інші
                        згоди чи документи у письмовій формі, які необхідні
                        Виконавцю для надання Послуг за цим Договором та/або які
                        передбачені чинним законодавством України.
                      </p>
                      <p>
                        4.2.5 Суворо дотримуватися Правил підготовки пацієнта
                        перед відбором зразка біологічного матеріалу (Правил
                        підготовки до здачі аналізів), які розміщені на Сайті
                        Виконавця за посиланням{" "}
                        <a href="http://vitalab.com.ua">
                          http://vitalab.com.ua
                        </a>{" "}
                        та належної поведінки у пункті забору біоматеріалу. Якщо
                        Пацієнтом є неповнолітня або недієздатна (обмежено
                        дієздатна) особа, то відповідальність за дотримання
                        правил підготовки Пацієнта і належної поведінки у пункті
                        забору біоматеріалу покладається на батьків (одного з
                        батьків) або іншого законного представника такої особи.
                      </p>
                      <p>
                        4.2.6 За умови надання Виконавцю для надання Послуг
                        зразків біоматеріалу, відібраних самостійно або третіми
                        особами, самостійно нести відповідальність за дотримання
                        правил підготовки пацієнта, правил відбору таких зразків
                        та належної якості таких зразків на момент їх передачі
                        Виконавцю.{" "}
                      </p>
                      <p>
                        4.2.7 На вимогу працівника Виконавця надати належним
                        чином оформлений документ, що підтверджує повноваження
                        Замовника на отримання результатів лабораторних
                        досліджень щодо Пацієнта та документ, що посвідчує особу
                        Замовника, якщо Замовник діє від імені та в інтересах
                        іншої особи.
                      </p>
                      <p>4.3 Виконавець має право:</p>
                      <p>
                        4.3.1 В односторонньому порядку змінювати перелік,
                        обсяг, ціну, порядок надання Послуг тощо, шляхом
                        розміщення інформації про такі зміни на Сайті Виконавця.
                        Замовник сплачує замовлені Послуги Виконавця відповідно
                        до ціни, яка є актуальною на момент здійснення оплати
                        такого Замовлення. В разі зміни ціни замовлених Послуг
                        після проведення оплати Замовлення, вартість Послуг
                        Виконавця перерахунку не підлягає, а Виконавець
                        зобов’язується надати Послуги за таким Замовленням.
                      </p>
                      <p>
                        4.3.2 Залучати третіх осіб (медичних фахівців, медичні
                        заклади тощо) для надання Послуг Пацієнту за цим
                        Договором.
                      </p>
                      <p>
                        4.3.3 Здійснювати акційні заходи з наданням знижок та
                        пільг на Послуги.
                      </p>
                      <p>
                        4.3.4 Інформувати Пацієнта та/або Замовника про будь-які
                        зміни, що стосуються Послуг, що надаються за цим
                        Договором.
                      </p>
                      <p>
                        4.3.5 Розкривати відомості про Пацієнта та/або Замовника
                        виключно у випадках, передбачених чинним законодавством
                        України.
                      </p>
                      <p>
                        4.3.6 У разі порушення Пацієнтом та/або Замовником умов
                        цього Договору, в тому числі, але не виключно в разі
                        невиконання рекомендацій Виконавця щодо підготовки до
                        взяття біоматеріалу, порушення правил перебування
                        пацієнтів у місці надання Послуг, відмові в наданні
                        інформованої добровільної згоди пацієнта, псуванні майна
                        Виконавця та/або майна відвідувачів чи працівників
                        Виконавця тощо, Виконавець має право розірвати цей
                        Договір в односторонньому порядку. При цьому кошти,
                        сплачені Замовником за Послуги, що фактично надані,
                        поверненню не підлягають.
                      </p>
                      <p>
                        4.3.7 Розірвати даний Договір в односторонньому порядку
                        в будь-яких інших випадках за ініціативою Виконавця із
                        наступним поверненням грошових коштів, сплачених
                        Замовником за Послуги, що не були фактично надані.
                      </p>
                      <p>4.4 Виконавець зобов’язується:</p>
                      <p>
                        4.4.1 Надавати Послуги належної якості та з дотриманням
                        вимог, стандартів, визначених законодавством України та
                        в строки, передбачені цим Договором.
                      </p>
                      <p>
                        4.4.2 Дотримуватись вимог та положень цього Договору.
                      </p>
                      <p>
                        4.4.3 Забезпечити участь кваліфікованого медичного
                        персоналу для надання Послуг в межах виконання
                        зобов’язань за цим Договором.
                      </p>
                      <p>
                        4.4.4 Використовувати ефективні методи діагностики та
                        медичні технології, дозволені до застосування чинним
                        законодавством України.
                      </p>
                      <p>
                        4.4.5 Забезпечити Пацієнта та/або Замовника інформацією,
                        що включає в себе відомості про місце надання Послуг,
                        режим роботи Виконавця, перелік Послуг із зазначенням їх
                        вартості та строків виконання, умови надання та
                        отримання цих Послуг, отримання додаткових знижок на
                        Послуги тощо.
                      </p>
                      <p>
                        4.4.6 Забезпечити режим конфіденційності даних, що
                        стосуються Пацієнта та/або Замовника та які отримані
                        Виконавцем на підставі цього Договору, в тому числі
                        дотримуватись вимог законодавства України про збереження
                        лікарської таємниці.
                      </p>
                      <p>
                        4.4.7 Інформувати Замовника та/або Пацієнта у випадку
                        неможливості надати Послуги за Замовленням повністю або
                        частково.
                      </p>
                      <p>
                        4.4.8 Відправляти лікарю, що видав Пацієнту направлення
                        результати проведених в інтересах Пацієнта медичних
                        досліджень.
                      </p>
                      <p>
                        <strong>5. ПЕРСОНАЛЬНІ ДАНІ</strong>
                      </p>
                      <p>
                        5.1 Шляхом проставлення відміток в полях: «Я даю згоду
                        на обробку персональних даних» та «Я згоден з умовами
                        публічного договору» в формі підтвердження онлайн
                        Замовлення на Сайті Виконавця:{" "}
                        <a href="http://vitalab.com.ua">
                          http://vitalab.com.ua
                        </a>{" "}
                        Пацієнт та/або Замовник:
                      </p>
                      <p className="ml-3">
                        • погоджується на передачу Виконавцю своїх персональних
                        даних в обсязі, необхідному для забезпечення надання
                        Виконавцем Послуг за цим Договором;
                      </p>
                      <p className="ml-3">
                        • розуміє, що розпорядником бази даних, до якої внесені
                        персональні дані, є ТОВ «Діагностичний лабораторний
                        центр «ВIТАЛАБ» (код ЄДРПОУ 42031591);
                      </p>
                      <p className="ml-3">
                        • надає Виконавцю згоду на передачу своїх персональних
                        даних третім особам, відповідно до законодавства
                        України. До таких третіх осіб належать органи державної
                        влади та/або місцевого самоврядування, адвокати, інші
                        особи, що мають право отримувати дану інформацію у
                        відповідності до вимог чинного законодавства, а також
                        контрагенти Виконавця, з якими Виконавцем були укладені
                        угоди про надання послуг, лікуючі лікарі, або лікарі,
                        які видали Пацієнту направлення на проведення в
                        інтересах Пацієнта лабораторної діагностики;
                      </p>
                      <p className="ml-3">
                        • надає згоду на передачу своїх персональних даних у
                        будь-яку іноземну державу для здійснення діяльності, що
                        є необхідною та мінімально достатньою для досягнення
                        мети здійснення такої обробки персональних даних;
                      </p>
                      <p className="ml-3">
                        • надає згоду на обробку персональних даних у будь-яких
                        інформаційних системах Виконавця.
                      </p>

                      <p>
                        5.2 Виконавець здійснює обробку персональних даних з
                        метою виконання Замовлення та забезпечення можливості
                        доступу до таких персональних даних, в тому числі, але
                        не виключно доступу до результату проведеної
                        лабораторної діагностики та будь-якої іншої інформації,
                        що стосується результатів надання Послуг за цим
                        Договором.
                      </p>
                      <p>
                        5.3 Виконавець має право здійснювати обробку виключно
                        тих персональних даних, що надаються Пацієнтом та/або
                        Замовником при оформленні Замовлення, та тих, що
                        стосуються результату лабораторної діагностики
                        біоматеріалу Пацієнта.
                      </p>
                      <p>
                        5.4 Одночасно з оформленням попереднього Замовлення на
                        надання Послуг Пацієнт та/або Замовник надає згоду на
                        використання його персональних даних та підтверджує, що
                        він ознайомлений з переліком Послуг та бажає отримати
                        саме такі, попередньо обрані Послуги Виконавця. Пацієнт
                        підтверджує, що надає право Виконавцю оформляти
                        попереднє Замовлення від імені Пацієнта та надавати від
                        імені Пацієнта згоду на обробку персональних даних та
                        згоду на медичне втручання. Якщо під час попереднього
                        оформлення Замовлення на надання Послуг Виконавця було
                        зазначено адресу електронної пошти та/або номер телефону
                        третьої особи, Пацієнт надає згоду Виконавцеві на
                        відправлення отриманих Виконавцем результатів досліджень
                        за цим Замовленням саме цими каналами зв’язку.
                      </p>
                      <p>
                        5.5 Виконавець зобов’язується забезпечити дотримання
                        режиму конфіденційності та захисту персональних даних
                        Пацієнта та/або Замовника під час здійснення їх обробки,
                        в тому числі дотримання таких умов обробки персональних
                        даних з боку працівників Виконавця, які отримують доступ
                        до зазначених персональних даних у зв’язку із виконанням
                        своїх трудових обов’язків перед Виконавцем.
                      </p>
                      <p>
                        5.6 Пацієнт та/або Замовник зобов’язується надавати
                        повну та правдиву інформацію про себе під час оформлення
                        Замовлення на Сайті Виконавця, а також під час візиту до
                        приміщення Виконавця для безпосереднього отримання
                        Послуг, а в разі недотримання такого обов'язку Замовник
                        та/або Пацієнт погоджується нести ризик настання
                        несприятливих наслідків у зв’язку з цим. У разі
                        виявлення неточностей або будь-яких розбіжностей між
                        персональними даними Пацієнта, зазначеними на Веб-сайті,
                        і персональними даними Пацієнта, наданими ним при
                        отриманні Послуги або результатів лабораторних
                        досліджень (паспортні дані, дані бланка Замовлення),
                        Виконавець, з метою забезпечення конфіденційності
                        медичної інформації, залишає за собою право відмовити в
                        наданні Послуги Пацієнту, до моменту з’ясування особи
                        Пацієнта.
                      </p>
                      <p>
                        <strong>6. КОНФІДЕНЦІЙНІСТЬ</strong>
                      </p>
                      <p>
                        6.1 Сторони визнають, що інформація, яка отримана в ході
                        надання Послуг за цим Договором та/або на виконання
                        цього Договору, в тому числі, але не виключно інформація
                        про факт звернення Пацієнта та/або Замовника до
                        Виконавця з метою отримання Послуг, перелік обраних
                        Послуг, інформація, яка отримана за результатами надання
                        Послуг, а також будь-яка інша інформація, розголошення
                        якої обмежується чинним законодавством України, є
                        конфіденційною інформацією за цим Договором.
                      </p>
                      <p>
                        6.2 Виконавець зобов’язується дотримувати сувору
                        конфіденційність відносно усієї інформації, отриманої
                        від Замовника та/або Пацієнта, і вживати всіх можливих
                        заходів для попередження несанкціонованого використання
                        або розкриття такої інформації.
                      </p>
                      <p>
                        6.3 Сторони не несуть відповідальності за порушення
                        конфіденційності, яке відбулося внаслідок форс-мажорних
                        обставин або внаслідок порушення конфіденційності за
                        вимогою державних органів згідно чинного законодавства
                        України.
                      </p>
                      <p>
                        6.4 Умови щодо конфіденційності, встановлені цим
                        Договором, діють без жодних часових обмежень.
                      </p>
                      <p>
                        <strong>7. ВАРТІСТЬ ПОСЛУГ ТА ПОРЯДОК ОПЛАТИ</strong>
                      </p>
                      <p>
                        7.1 Вартість Послуг за даним Договором та строки їх
                        виконання вказані в чинному Прайс-листі Виконавця та
                        розміщені на Сайті Виконавця за адресою:{" "}
                        <a href="http://vitalab.com.ua">
                          http://vitalab.com.ua
                        </a>
                        .
                      </p>
                      <p>
                        7.2 Виконавець має право в односторонньому порядку
                        змінювати ціни в Прайс-листі. Датою вступу в силу нових
                        цін є дата їх публікації на Сайті Виконавця. У разі
                        фактичної оплати послуг Замовником, при зміні ціни у
                        день звернення Пацієнта, вартість послуг не
                        перераховується.
                      </p>
                      <p>
                        7.3 Оплата Послуг здійснюється Замовником в національній
                        валюті України - гривні, шляхом здійснення грошового
                        переказу у спосіб, запропонований Виконавцем на Сайті
                        Виконавця, в тому числі за допомогою систем
                        дистанційного обслуговування.
                      </p>
                      <p>
                        7.4 Виконавець забезпечує надання замовлених Послуг
                        Пацієнту після їх попередньої та повної оплати.
                      </p>
                      <p>
                        7.5 Замовник несе відповідальність за правильність
                        здійснених ним платежів.
                      </p>
                      <p>
                        7.6 У випадку анулювання Замовником оформленого
                        Замовлення протягом строку дії Замовлення та/або у
                        випадку анулювання Замовлення Виконавцем відповідно до
                        п. 4.2.2. Договору вартість оплачених, але не наданих
                        Послуг може бути повернута Замовнику за його письмовою
                        заявою у формі, в якій було здійснено оплату таких
                        Послуг, протягом 30 робочих днів з моменту прийняття
                        такого рішення Виконавцем.
                      </p>
                      <p>
                        7.7 Заява на повернення грошових коштів у випадках
                        передбачених п. 7.6. Договору оформляється у вигляді
                        паперового документа, який подається представнику
                        Виконавця за адресою надання Послуг Виконавця (м.
                        Дніпро, вул. Херсонська, 10А) або направляється
                        рекомендованою поштою на адресу Виконавця разом із
                        копією документа, що посвідчує особу Замовника, копією
                        довідки про присвоєння ідентифікаційного коду та копією
                        платіжного документа, який підтверджує здійснення оплати
                        Послуг.
                      </p>
                      <p>
                        <strong>8. ПОРЯДОК ТА СТРОКИ НАДАННЯ ПОСЛУГ</strong>
                      </p>
                      <p>
                        8.1 З метою отримання Послуг Пацієнт та/або Замовник:
                      </p>
                      <p className="ml-3">
                        • формує Замовлення на сайті Виконавця{" "}
                        <a href="http://vitalab.com.ua">
                          http://vitalab.com.ua
                        </a>
                        , обирає адресу пункту забору біоматеріалу, в якому
                        бажає отримати Послугу, обирає перелік необхідних Послуг
                        та вносить інші дані, що необхідні Виконавцю для надання
                        Послуг за таким Замовленням;
                      </p>
                      <p className="ml-3">
                        • ознайомлюється та погоджується з умовами цього
                        Договору, з Правилами підготовки пацієнта перед відбором
                        зразка біологічного матеріалу, надає згоду на обробку та
                        використання своїх персональних даних та інформовану
                        добровільну згоду на проведення медичного втручання;
                      </p>
                      <p className="ml-3">
                        • здійснює оплату Послуг у спосіб, визначений на Сайті
                        Виконавця.
                      </p>

                      <p>
                        При цьому оформлення Замовником вказаного Замовлення,
                        його підтвердження та оплата трактується як факт
                        достатнього і повного ознайомлення та погодження
                        Замовника з усіма без винятку умовами Договору, в тому
                        числі, але не виключно з вартістю та порядком надання
                        Послуг, правилами перебування у приміщенні Виконавця,
                        правилами підготовки до проведення дослідження здачі
                        аналізів, тощо.
                      </p>
                      <p>
                        8.2 При оформленні Замовлення на Послуги
                        розповсюджується лише один вид знижки. Знижки на послуги
                        не сумуються.
                      </p>
                      <p>
                        8.3 Пацієнт та/або Замовник має право анулювати
                        оформлене на Сайті Замовлення до моменту фактичного
                        початку надання Послуг за таким Замовленням, що
                        збігається із моментом здійснення забору біоматеріалу
                        Пацієнта чи прийняття самостійно підготовленого
                        Пацієнтом біоматеріалу. При цьому Пацієнт та/або
                        Замовник має право оформити нове Замовлення на Сайті
                        Виконавця.
                      </p>
                      <p>
                        8.4 У випадку виявлення Пацієнтом та/або Замовником
                        допущених ним помилок у даних, зазначених в Замовленні,
                        Пацієнт та/або Замовник повинен негайно повідомити
                        Виконавця про виявлені помилки, а в разі неповідомлення
                        – нести ризик настання несприятливих наслідків у зв’язку
                        з цим.
                      </p>
                      <p>
                        8.5 Забір біоматеріалу Пацієнта для надання Послуг за
                        Замовленням проводиться персоналом Виконавця у визначені
                        для забору біоматеріалу робочі години. У разі оформлення
                        замовлення після завершення визначених годин забору
                        біоматеріалу, забір здійснюється, починаючи з наступного
                        після оформлення Замовлення робочого дня.
                      </p>
                      <p>
                        8.6 Строк надання Послуг (проведення лабораторного
                        дослідження) відраховується з часу реєстрації забору
                        біоматеріалу, такий строк може бути продовжено
                        Виконавцем на строк до 30 робочих днів, якщо таке
                        продовження допускається технологічним процесом
                        виконання відповідного лабораторного діагностичного
                        дослідження. В даному випадку Виконавець додатково
                        повідомляє Пацієнта та/або Замовника про продовження
                        строку надання Послуг.
                      </p>
                      <p>
                        8.7 Строк дії Замовлення з моменту його оформлення
                        складає 30 календарних днів. Цей строк може бути
                        продовжений на розсуд Виконавця.
                      </p>
                      <p>
                        <strong>9. ЗМІНА УМОВ ДОГОВОРУ</strong>
                      </p>
                      <p>
                        9.1 Виконавець має право на внесення змін до даного
                        Договору в односторонньому порядку.
                      </p>
                      <p>
                        9.2 Замовлення Послуг за цим Договором здійснюється
                        відповідно до умов Договору в редакції, чинній на момент
                        оформлення такого Замовлення.
                      </p>
                      <p>10. ДІЯ ДОГОВОРУ</p>
                      <p>
                        10.1 Цей Договір вступає в силу з моменту його
                        розміщення на Сайті Виконавця та діє до моменту повного
                        виконання Сторонами своїх зобов’язань за цим Договором.
                      </p>
                      <p>
                        <strong>11. ВИРІШЕННЯ СПОРІВ</strong>
                      </p>
                      <p>
                        11.1 У разі виникнення суперечок між Сторонами за цим
                        Договором, такі суперечки вирішуються ними шляхом
                        переговорів.
                      </p>
                      <p>
                        11.2 Дотримання процедури досудового врегулювання спорів
                        за цим Договором є обов’язковою. Процедура досудового
                        врегулювання спорів реалізується шляхом направлення
                        письмової претензії заявника. Відповідь на претензію має
                        бути надана в місячний строк з моменту отримання
                        претензії.
                      </p>
                      <p>
                        11.3 У разі неможливості вирішення спору шляхом
                        переговорів між Сторонами після дотримання процедури
                        досудового врегулювання спору, такий спір може бути
                        переданий на розгляд до компетентного суду України.
                      </p>
                      <p>
                        <strong>12. ВІДПОВІДАЛЬНІСТЬ СТОРІН </strong>
                      </p>
                      <p>
                        12.1 Сторони даного Договору несуть відповідальність за
                        дотримання умов Договору згідно вимог діючого
                        законодавства України.
                      </p>
                      <p>12.2 Виконавець не несе відповідальності за:</p>
                      <p className="ml-3">
                        • прямі або непрямі збитки, втрачену вигоду або моральну
                        шкоду Замовника та/або Пацієнта, пов’язані із
                        використанням або неможливістю користування Послугою;
                      </p>
                      <p className="ml-3">
                        • за якість Послуг у разі недотримання Пацієнтом Правил
                        підготовки пацієнта перед відбором зразка біологічного
                        матеріалу та/або надання зразків неналежної якості,
                        зібраних самостійно чи третіми особами.
                      </p>

                      <p>
                        12.3 У всьому, що не врегульоване цим Договором, Сторони
                        керуються чинним законодавством України.
                      </p>
                      <p>
                        12.4 Жодна зі Сторін не несе відповідальність за
                        невиконання чи неналежне виконання своїх зобов’язань по
                        цьому Договору, якщо це невиконання чи неналежне
                        виконання зумовлені дією обставин непереборної сили, що
                        знаходились поза контролем Сторін (форс-мажорних
                        обставин), які підтверджені у встановленому законом
                        порядку.
                      </p>
                      <p>
                        <strong>13. ЗАКЛЮЧНІ ПОЛОЖЕННЯ</strong>
                      </p>
                      <p>
                        13.1 Даний Договір є публічним договором в розумінні
                        чинного законодавства України.
                      </p>
                      <p>
                        13.2 Цей Договір вважається укладеним з моменту
                        одержання Виконавцем від Замовника відповіді про
                        прийняття умов даного Договору в порядку, визначеному
                        цим Договором.
                      </p>
                      <p>
                        13.3 Відсутність підписаного Сторонами примірника
                        Договору на паперовому носії з проставленням підписів
                        обох Сторін не є підставою визнання такого Договору не
                        укладеним за умови здійснення Пацієнтом та/або
                        Замовником дій, спрямованих на виконання цього Договору,
                        зокрема, але не виключно проведення оплати Послуг за цим
                        Договором, отримання Послуг за цим Договором тощо.
                      </p>
                      <p>
                        13.4 Визнання будь-якого положення або пункту даного
                        Договору чи додатків до нього недійсним не впливає на
                        дійсність решти положень і умов Договору.
                      </p>
                      <p>
                        13.5 Всі додатки, зміни й доповнення до даного Договору
                        є його невід’ємною частиною і підлягають розміщенню на
                        Сайті Виконавця.
                      </p>

                      <br />
                      <p>
                        <strong>АДРЕСА ТА РЕКВІЗИТИ ВИКОНАВЦЯ</strong>
                      </p>
                      <p>ТОВ «Діагностичний лабораторний центр «ВIТАЛАБ»</p>
                      <p>
                        Юридична адреса: 49000 м. Дніпро, вул. Космічна, 20{" "}
                      </p>
                      <p>
                        Фактична адреса: 49101 м. Дніпро, вул. Херсонська, 10А
                      </p>
                      <p>Код ЄДРПОУ 42031591</p>
                      <p>Код ІПН 420315904634</p>
                      <p>Рах. стандарту IBAN UA853052990000026001050307302</p>
                      <p>Банк АТ КБ "ПРИВАТБАНК"</p>
                      <p>МФО 305299</p>
                      <p>Тел. (068) 500-75-75, (067) 310-85-80</p>
                      <p>Ліцензія № 1758 від 27.09.2018</p>
                      <p>e-mail: info@vitalab.com.ua</p>
                      <br />

                      <p>
                        <strong>
                          Додаток 1 до Публічного договору про надання медичних
                          послуг
                        </strong>
                      </p>
                      <p>
                        ІНФОРМОВАНА ДОБРОВІЛЬНА ЗГОДА НА ОБРОБКУ ПЕРСОНАЛЬНИХ
                        ДАНИХ ТА НА ПРОВЕДЕННЯ МЕДИЧНОГО ВТРУЧАННЯ
                      </p>
                      <p>
                        Шляхом проставлення мною відміток в полях{" "}
                        <strong>
                          «Я даю згоду на обробку персональних даних» та «Я
                          згоден з умовами публічного договору»
                        </strong>{" "}
                        в формі підтвердження онлайн Замовлення на сайті{" "}
                        <a href="http://vitalab.com.ua">
                          http://vitalab.com.ua
                        </a>
                        , я підтверджую, що:
                      </p>
                      <p className="ml-3">
                        • мене повідомлено про те, що відповідно до Закону
                        України «Про захист персональних даних» я є суб’єктом
                        персональних даних, а «Діагностичний лабораторний центр
                        «ВIТАЛАБ» (далі - Виконавець) – володільцем;
                      </p>
                      <p className="ml-3">
                        • мене повідомлено та я погоджуюсь з тим, що ТОВ
                        ««Діагностичний лабораторний центр «ВIТАЛАБ» збирає та
                        оброблює такі дані про мене як суб’єкта персональних
                        даних, а саме: прізвище, ім’я, по-батькові, номер
                        мобільного телефону, електронну пошту та медичні
                        показники здоров’я, отримані в процесі виконання
                        лабораторних досліджень з метою проведення лабораторних
                        досліджень наданого біологічного матеріалу, а також в
                        цілях бухгалтерського обліку та статистики та надання
                        мені або вказаним мною особам можливості доступу до
                        персональних даних, зокрема, але не виключно до
                        результатів лабораторних досліджень (далі – Мета
                        обробки);
                      </p>
                      <p className="ml-3">
                        • я усвідомлюю, що джерелом персональних даних є
                        інформація, яку я надаю Виконавцю при реєстрації
                        Замовлення. Мене повідомлено про те, що дані, зібрані
                        ТОВ «Діагностичний лабораторний центр «ВIТАЛАБ» від
                        суб’єктів персональних даних, обробляються в базі
                        «Пацієнти», у будь-яких комп'ютерних та/або
                        інформаційних системах, які використовуються на законних
                        підставах суб'єктом, що здійснює обробку персональних
                        даних, в захищеному середовищі з використанням технічних
                        та програмних засобів захисту.
                      </p>
                      <p className="ml-3">
                        • я надаю згоду на внесення до локальної інформаційної
                        системи ТОВ «Діагностичний лабораторний центр «ВIТАЛАБ»
                        моїх (моєї дитини або вказаної мною особи) персональних
                        даних, в тому числі результатів лабораторних досліджень.
                      </p>

                      <p>
                        Мені зрозумілі всі мої права, передбачені статтею 8
                        Закону України «Про захист персональних даних»,
                        включаючи право отримувати інформацію про умови надання
                        доступу до персональних даних, право на доступ до моїх
                        персональних даних, право отримувати відповідь про те,
                        чи обробляються мої персональні дані, а також отримувати
                        зміст таких персональних даних, право пред’являти
                        вмотивовану вимогу володільцю персональних даних із
                        запереченням проти обробки своїх персональних даних,
                        право пред'являти вмотивовану вимогу щодо зміни або
                        знищення своїх персональних даних будь-яким володільцем
                        та розпорядником персональних даних, якщо ці дані
                        обробляються незаконно чи є недостовірними, право на
                        захист своїх персональних даних від незаконної обробки
                        та випадкової втрати, знищення, пошкодження у зв'язку з
                        умисним приховуванням, ненаданням чи несвоєчасним їх
                        наданням, а також на захист від надання відомостей, що є
                        недостовірними чи ганьблять честь, гідність та ділову
                        репутацію, право звертатися із скаргами на обробку своїх
                        персональних даних до Уповноваженого Верховної Ради
                        України з прав людини або до суду, право застосовувати
                        засоби правового захисту в разі порушення законодавства
                        про захист персональних даних, право знати механізм
                        автоматичної обробки персональних даних, право на захист
                        від автоматизованого рішення, яке має для мене правові
                        наслідки, право відкликання цієї Інформованої згоди
                        шляхом подачі запиту на видалення даних. Також мені було
                        роз’яснено та зрозуміло моє право на внесення
                        застережень стосовно обмеження права ТОВ «Діагностичний
                        лабораторний центр «ВIТАЛАБ» на обробку моїх
                        персональних даних під час надання цієї Інформованої
                        згоди. Шляхом проставлення відміток в полях «Я даю згоду
                        на обробку персональних даних» та «Я згоден з умовами
                        публічного договору», підтверджую, що зазначені
                        застереження у мене відсутні.
                      </p>
                      <p>
                        Шляхом проставлення мною відміток в полях «Я даю згоду
                        на обробку персональних даних» та «Я згоден з умовами
                        публічного договору» в формі підтвердження онлайн
                        Замовлення на сайті{" "}
                        <a href="http://vitalab.com.ua">
                          http://vitalab.com.ua
                        </a>{" "}
                        я надаю ТОВ «Діагностичний лабораторний центр «ВIТАЛАБ»
                        згоду на обробку моїх (моєї дитини або вказаної мною
                        особи) персональних даних, а також згоду на
                        транскордонну передачу таких персональних даних в
                        іноземну державу для здійснення діяльності відповідно до
                        зазначеної Мети обробки.
                      </p>
                      <p>
                        Я проінформований(-а) про те, що розпорядниками
                        персональних даних, переданих згідно з цією Інформованою
                        згодою, є ТОВ «Діагностичний лабораторний центр
                        «ВIТАЛАБ».
                      </p>
                      <p>
                        Я проінформований(-а) та погоджуюсь на передачу моїх
                        персональних даних третім особам виключно відповідно до
                        Мети обробки персональних даних зазначеної вище. До
                        таких третіх осіб належать органи державної влади та/або
                        місцевого самоврядування, адвокати, інші особи, що мають
                        право отримувати дану інформацію у відповідності до
                        вимог чинного законодавства, а також контрагенти
                        Виконавця, з якими Виконавцем були укладені угоди про
                        надання послуг/субпідряду, лікуючі лікарі, або лікарі,
                        які видали Пацієнту направлення скерування на проведення
                        в інтересах Пацієнта лабораторної діагностики, а також
                        Замовники, які не є Пацієнтами.
                      </p>
                      <p>
                        Я погоджуюсь, що у випадку проведення тестування на
                        ВІЛ-інфекцію мої персональні дані можуть передаватись у
                        порядку, передбаченому чинним законодавством України,
                        виключно до закладу охорони здоров’я, який здійснює
                        підтверджувальні дослідження, та до Партнера, який
                        здійснює господарську діяльність за адресою відділення
                        медичної лабораторії/пункту забору біологічного
                        матеріалу, до якого я звернувся(-лась) з метою
                        проведення тестування на ВІЛ-інфекцію, при цьому
                        персональні дані не передаються іншим Розпорядникам або
                        третім особам.
                      </p>
                      <p>
                        Я погоджуюсь на отримання інформації за допомогою
                        текстових та/або SMS-повідомлень, в тому числі
                        надісланих за допомогою програм та мобільних додатків,
                        про готовність результатів досліджень; отримання
                        резульатів у вигляді електронних документів на
                        електронну адресу чи інші засоби зв’язку (Viber,
                        Telegram, інші месенджери), зазначені мною, та іншої
                        інформації щодо охорони здоров’я, медичних послуг та
                        спеціальних пропозицій у електронних та
                        SMS-повідомленнях відповідно до Мети обробки
                        персональних даних. Мене повідомлено про забезпечення
                        конфіденційності моїх (моєї дитини або вказаної мною
                        особи) даних. Я розумію, що доставка повідомлення
                        залежить від мобільних операторів та постачальників
                        послуг зв’язку та не є гарантованою. ТОВ ««Діагностичний
                        лабораторний центр «ВIТАЛАБ» не несе відповідальність за
                        отримання мною повідомлення.
                      </p>
                      <p>
                        Погоджуюсь з тим, що у разі передачі мною даних щодо
                        замовлення третім особам, ТОВ «Діагностичний
                        лабораторний центр «ВIТАЛАБ» не несе відповідальності за
                        недотримання конфіденційності.
                      </p>
                      <p>
                        Я погоджуюсь, що ТОВ «Діагностичний лабораторний центр
                        «ВIТАЛАБ» не може гарантувати та не несе
                        відповідальності за доставку результатів клінічної
                        лабораторної діагностики електронною поштою, тому що
                        доставка електронного листа залежить від налаштувань
                        поштових серверів, антивірусних систем та спам-фільтрів
                        моєї поштової скриньки.
                      </p>
                      <p>
                        <strong>
                          Інформована добровільна згода на проведення медичного
                          втручання та можливі наслідки.
                        </strong>
                      </p>
                      <p>
                        Шляхом проставлення мною відмітки в полі «Я згоден з
                        умовами публічного договору» в формі підтвердження
                        онлайн Замовлення на сайті{" "}
                        <a href="http://vitalab.com.ua">
                          http://vitalab.com.ua
                        </a>
                        , я підтверджую, що:
                      </p>
                      <p className="ml-3">
                        • Ознайомлений(-а) з характером кожної процедури,
                        позначеної в Замовленні, ризиками медичного втручання
                        під час її проведення, правом вимагати припинення
                        процедури та надаю цю Інформовану згоду на медичне
                        втручання відповідно до Закону України «Основи
                        законодавства України про охорону здоров’я» від 19
                        листопада 1992 року.
                      </p>
                      <p className="ml-3">
                        • Ознайомлений(-а) з Правилами підготовки пацієнта до
                        проведення досліджень, які будуть виконані відповідно до
                        Замовлення та розміщені на сайті{" "}
                        <a href="http://vitalab.com.ua">
                          http://vitalab.com.ua
                        </a>
                        , недотримання яких може вплинути на точність
                        результатів дослідження.
                      </p>
                      <p className="ml-3">
                        • Мені відомо, що основний спосіб взяття венозної крові
                        для лабораторного дослідження – проколювання ліктьової
                        вени, що пов’язане з мікротравматизацією судин. Дана
                        процедура може бути травматичною, і для того, щоб
                        уникнути утворення гематоми, рекомендовано притиснути
                        місце проколу на 10-15 хв та зігнути руку в ліктьовому
                        суглобі.
                      </p>
                      <p className="ml-3">
                        • Мені відомо, що забір біологічного матеріалу на
                        лабораторне дослідження включає в себе проведення
                        маніпуляції у жінок – із заднього зведення піхви, із
                        цервікального каналу та уретри, у чоловіків – з уретри.
                        Після взяття біологічного матеріалу протягом трьох діб
                        може зберігатися неприємне відчуття при сечовипусканні,
                        а також незначні кров’янисті виділення з уретри.
                      </p>
                      <p className="ml-3">
                        • Я усвідомлюю, що в деяких випадках для виконання
                        дослідження може бути необхідно здійснити додатковий або
                        повторний забір біоматеріалу, та погоджуюсь на такий
                        додатковий або повторний забір у разі виникнення
                        необхідності.
                      </p>
                      <p className="ml-3">
                        • Мені відомо, що результат лабораторного дослідження
                        залежить від виду тест-системи та обладнання, на якому
                        проводиться дослідження.
                      </p>
                      <p className="ml-3">
                        • Мені відомо, що результати лабораторних досліджень не
                        є достатньою підставою для постановки діагнозу.
                        Інтерпретація результатів та постановка діагнозу
                        виконується тільки лікарем.
                      </p>
                      <p className="ml-3">
                        • Підтверджую, що перевірив(-ла) коректність послуг, що
                        зазначені у бланку Замовлення та переконався(-лась), що
                        послуги зазначені вірно, тому, дані послуги вважаються
                        замовленими належним чином та підлягають виконанню ТОВ
                        «Діагностичний лабораторний центр «ВIТАЛАБ».
                      </p>
                      <p className="ml-3">
                        • Повідомив(-ла) медичного працівника про алергічні
                        прояви або індивідуальну непереносимість спирту та
                        медикаментів.
                      </p>
                      <p className="ml-3">
                        • Зрозумів(-ла) мету та характер медичного втручання. У
                        випадку виникнення ускладнень (таких як запаморочення,
                        втрата свідомості, тощо) під час медичного втручання, я
                        заздалегідь надаю згоду на застосування всіх необхідних
                        та можливих заходів з метою їх усунення.
                      </p>
                      <p className="ml-3">
                        • Результати лабораторних досліджень надаються
                        українською мовою, окрім певних винятків.
                      </p>
                      <p className="ml-3">
                        • Підтверджую, що мав(-ла) можливість задавати будь-які
                        питання стосовно медичних послуг, які надаються мені
                        та/або пацієнту ТОВ «Діагностичний лабораторний центр
                        «ВIТАЛАБ» та отримав(-ла) на них вичерпну відповідь.
                      </p>

                      <p>
                        Шляхом проставляння відмітки в полі «Я згоден з умовами
                        публічного договору» в формі онлайн Замовлення на сайті{" "}
                        <a href="http://vitalab.com.ua">
                          http://vitalab.com.ua
                        </a>{" "}
                        я підтверджую, що надаю право Виконавцю зберігати мій
                        біологічний матеріал, якщо такий залишиться після
                        проведення замовлених мною лабораторних досліджень, з
                        метою можливої подальшої передачі (безпосередньої або
                        через інші компанії) такого матеріалу та моїх
                        знеособлених (таких, з яких будуть вилучені будь-які
                        дані, які дозволять прямо чи опосередковано мене
                        ідентифікувати) медичних даних дослідницьким компаніям,
                        що займаються вивченням біологічних зразків для
                        вдосконалення існуючих методів лікування та розробки
                        нових ліків. Я погоджуюсь з тим, що це не потребуватиме
                        взяття у мене більшої кількості біологічного матеріалу,
                        ніж це необхідно для надання замовлених мною послуг.
                      </p>
                      <p>
                        Шляхом проставляння відмітки в полі «Я згоден з умовами
                        публічного договору» в формі онлайн Замовлення на сайті{" "}
                        <a href="http://vitalab.com.ua">
                          http://vitalab.com.ua
                        </a>{" "}
                        я підтверджую, що надаю право зберігати мій біологічний
                        матеріал, якщо такий залишиться після проведення
                        замовлених мною лабораторних досліджень та надаю дозвіл
                        ТОВ «Діагностичний лабораторний центр «ВIТАЛАБ» на
                        подальше використання знеособлених залишкових зразків
                        мого біологічного матеріалу на розсуд Виконавця з метою
                        та у спосіб, що відповідають чинному законодавству
                        України, в тому числі шляхом передачі третім особам з
                        метою здійснення науково-дослідницької діяльності.
                      </p>
                      <p>
                        Шляхом проставлення мною відміток в полях «Я даю згоду
                        на обробку персональних даних» та «Я згоден з умовами
                        публічного договору» в формі підтвердження онлайн
                        Замовлення на сайті{" "}
                        <a href="http://vitalab.com.ua">
                          http://vitalab.com.ua
                        </a>
                        , я підтверджую, що я надаю згоду на проведення
                        медичного втручання та обробку персональних даних у
                        випадку <strong>кожного наступного звернення</strong> до
                        ТОВ «Діагностичний лабораторний центр «ВIТАЛАБ». У
                        випадку зміни відомостей персональних даних зобов’язуюсь
                        повідомити про це Виконавця у перший візит після таких
                        змін. Мені відомо, що дана інформована згода після її
                        підписання зберігається в електронній формі в архіві
                        Виконавця. Я підтверджую та розумію, що копія цієї
                        інформованої згоди визнається достатнім доказом факту
                        наявності згоди на медичне втручання та згоди на обробку
                        даних, зазначених у ній та замовленні.
                      </p>
                      <p>
                        Я бажаю та погоджуюсь отримувати повідомлення та
                        електронні листи від ТОВ «Діагностичний лабораторний
                        центр «ВIТАЛАБ» за номером мобільного телефону та
                        адресою електронної пошти, що були зазначені мною
                        особисто під час візиту до пункту забору біоматеріалу
                        та/або у формі онлайн Замовлення на веб-сайті{" "}
                        <a href="http://vitalab.com.ua">
                          http://vitalab.com.ua
                        </a>
                        .
                      </p>
                      <p>
                        Даною інформованою згодою я підтверджую, що є законним
                        представником Пацієнта (батьки (усиновлювачі), опікуни,
                        піклувальники або інші законні представники для осіб,
                        які не досягли вісімнадцятирічного віку, осіб, які
                        визнані судом обмежено дієздатними або недієздатним) та
                        володію необхідною правоздатністю та дієздатністю для
                        надання згоди на медичне втручання щодо Пацієнта,
                        обробку його персональних даних та вчинення правочину
                        про надання медичних послуг.
                      </p>
                      <p>
                        Текст даної інформованої згоди мною прочитано і
                        проставлянням відміток в полях «Я даю згоду на обробку
                        персональних даних» та «Я згоден з умовами публічного
                        договору» в формі онлайн Замовлення на веб-сайті{" "}
                        <a href="http://vitalab.com.ua">
                          http://vitalab.com.ua
                        </a>
                        , я засвідчую, що згоден із усіма пунктами цього
                        документу та документами, правилами, положеннями, на які
                        є посилання в цьому документі, положення яких мені
                        роз’яснені і зрозумілі, а також підтверджую
                        достовірність інформації, вказаної мною у Замовленні.
                      </p>
                      <div className="py-4">
                        <TermsCheckbox
                          checked={checked}
                          setChecked={setChecked}
                        />
                      </div>
                    </div>
                    <div className="mb-4 flex w-full px-6">
                      <Button
                        className="mt-6 w-full"
                        onClick={() => {
                          mutation.mutate({ ...userData, ...userPhone })
                        }}
                        // disabled={!isScrolledToBottom}
                        disabled={!checked}
                      >
                        Прийняти умови та зареєструватися
                      </Button>
                    </div>
                  </div>
                </Card>
              </div>
            </div>
          </div>
        </div>
      </Section>
    </>
  )
}

Tos.getLayout = (page) => {
  return <Layout>{page}</Layout>
}

export default Tos
